[
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign currency exchange rates fixed for today",
    "description": "KATHMANDU: Nepal Rastra Bank has set the foreign currency exchange rates for today. The buying rate of one US dollar has been fixed at Rs 145.28 and the selling rate at Rs 145.88. The buying rate of one euro stands at Rs 170.92 and the selling rate at Rs 171.…",
    "url": "https://english.khabarhub.com/2026/22/536132/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-22T00:06:56+00:00",
    "content": "KATHMANDU: Nepal Rastra Bank has set the foreign currency exchange rates for today. The buying rate of one US dollar has been fixed at Rs 145.28 and the selling rate at Rs 145.88. The buying rate of one euro stands at Rs 170.92 and the selling rate at Rs 171.63. Similarly, the UK pound sterling is being traded at a buying rate of Rs 195.74 and a selling rate of Rs 196.54, while the Swiss franc has a buying rate of Rs 187.19 and a selling rate of Rs 187.97. Likewise, the buying rate of one Australian dollar is Rs 102.45 and the selling rate is Rs 102.87. The Canadian dollar is priced at Rs 106.16 for buying and Rs 106.59 for selling, while the Singapore dollar has been fixed at Rs 114.50 for buying and Rs 114.97 for selling. Ten Japanese yen are being bought at Rs 9.36 and sold at Rs 9.40. The Chinese yuan has a buying rate of Rs 21.03 and a selling rate of Rs 21.12. The Saudi Arabian riyal is set at Rs 38.73 for buying and Rs 38.89 for selling, while the Qatari riyal stands at Rs 39.88 for buying and Rs 40.05 for selling. Similarly, the Thai baht has a buying rate of Rs 4.66 and a selling rate of Rs 4.68. The UAE dirham is being traded at Rs 39.55 for buying and Rs 39.72 for selling. The Malaysian ringgit has been fixed at Rs 37.22 for buying and Rs 37.38 for selling. The South Korean won stands at Rs 10.03 for buying and Rs 10.07 for selling. The Swedish kronor is priced at Rs 16.02 for buying and Rs 16.09 for selling, while the Danish kronor is set at Rs 22.88 for buying and Rs 22.97 for selling. The Hong Kong dollar has a buying rate of Rs 18.59 and a selling rate of Rs 18.67. The Kuwaiti dinar is being bought at Rs 475.63 and sold at Rs 477.59. The Bahraini dinar stands at Rs 385.31 for buying and Rs 386.90 for selling, while the Omani rial has been fixed at Rs 377.38 for buying and Rs 378.93 for selling. The exchange rate for 100 Indian rupees has been set at Rs 160 for buying and Rs 160.15 for selling. Nepal Rastra Bank stated that the exchange rates may be revised at any time as necessary. It also noted that rates offered by commercial banks may vary, and updated rates are available on the central bank’s official website. Publish Date : 22 February 2026 05:56 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  },
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign currency exchange rates fixed for today",
    "description": "KAHTMANDU: Nepal Rastra Bank (NRB) has published the foreign currency exchange rates for today. According to the central bank, the buying rate of one US dollar has been set at Rs 145.28 and the selling rate at Rs 145.88. The buying rate of one euro stands at …",
    "url": "https://english.khabarhub.com/2026/21/536028/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-21T02:45:59+00:00",
    "content": "KAHTMANDU: Nepal Rastra Bank (NRB) has published the foreign currency exchange rates for today. According to the central bank, the buying rate of one US dollar has been set at Rs 145.28 and the selling rate at Rs 145.88. The buying rate of one euro stands at Rs 170.92 and the selling rate at Rs 171.63. Similarly, the UK pound sterling is being traded at Rs 195.74 (buying) and Rs 196.54 (selling), while the Swiss franc is fixed at Rs 187.19 (buying) and Rs 187.97 (selling). The Australian dollar is valued at Rs 102.45 (buying) and Rs 102.87 (selling), the Canadian dollar at Rs 106.16 (buying) and Rs 106.59 (selling), and the Singapore dollar at Rs 114.50 (buying) and Rs 114.97 (selling). The buying rate for 10 Japanese yen is Rs 9.36 and the selling rate is Rs 9.40. The Chinese yuan is set at Rs 21.03 (buying) and Rs 21.12 (selling). The Saudi Arabian riyal is fixed at Rs 38.73 (buying) and Rs 38.89 (selling), while the Qatari riyal stands at Rs 39.88 (buying) and Rs 40.05 (selling). Likewise, the Thai baht is traded at Rs 4.66 (buying) and Rs 4.68 (selling), the UAE dirham at Rs 39.55 (buying) and Rs 39.72 (selling), the Malaysian ringgit at Rs 37.22 (buying) and Rs 37.38 (selling), and the South Korean won at Rs 10.03 (buying) and Rs 10.07 (selling). The Swedish krona is valued at Rs 16.02 (buying) and Rs 16.09 (selling), while the Danish krone is set at Rs 22.88 (buying) and Rs 22.97 (selling). Similarly, the Hong Kong dollar is fixed at Rs 18.59 (buying) and Rs 18.67 (selling). The Kuwaiti dinar is valued at Rs 475.63 (buying) and Rs 477.59 (selling), the Bahraini dinar at Rs 385.31 (buying) and Rs 386.90 (selling), and the Omani riyal at Rs 377.38 (buying) and Rs 378.93 (selling). The exchange rate for Indian currency has been set at Rs 160 for buying and Rs 160.15 for selling per 100 Indian rupees. Nepal Rastra Bank has stated that these exchange rates may be revised at any time as necessary. The rates determined by commercial banks may vary, and updated information is available on the central bank’s official website. Publish Date : 21 February 2026 08:59 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  },
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign currency exchange rates fixed for today",
    "description": "KATHMANDU: Nepal Rastra Bank has published the official foreign exchange rates for today (Friday). According to the central bank, the buying rate of one US dollar has been fixed at Rs 144.78 and the selling rate at Rs 145.38. The buying rate of one Euro stand…",
    "url": "https://english.khabarhub.com/2026/20/535867/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-20T01:44:25+00:00",
    "content": "KATHMANDU: Nepal Rastra Bank has published the official foreign exchange rates for today (Friday). According to the central bank, the buying rate of one US dollar has been fixed at Rs 144.78 and the selling rate at Rs 145.38. The buying rate of one Euro stands at Rs 170.57 and the selling rate at Rs 171.28. One UK pound sterling is being traded at a buying rate of Rs 195.08 and a selling rate of Rs 195.89, while one Swiss franc has a buying rate of Rs 187.04 and a selling rate of Rs 187.82. Similarly, the buying rate of one Australian dollar is Rs 102.08 and the selling rate Rs 102.50. The Canadian dollar is fixed at Rs 105.78 for buying and Rs 106.21 for selling, while the Singapore dollar is set at Rs 114.20 for buying and Rs 114.68 for selling. The buying rate of 10 Japanese yen has been fixed at Rs 9.36 and the selling rate at Rs 9.40. One Chinese yuan is being exchanged at Rs 20.96 for buying and Rs 21.04 for selling. The Saudi Arabian riyal has a buying rate of Rs 38.60 and a selling rate of Rs 38.76, while the Qatari riyal stands at Rs 39.72 for buying and Rs 39.89 for selling. According to the central bank, one Thai baht is being bought at Rs 4.64 and sold at Rs 4.66. The UAE dirham has a buying rate of Rs 39.42 and a selling rate of Rs 39.58. The Malaysian ringgit is set at Rs 37.04 for buying and Rs 37.20 for selling. The buying rate of 100 South Korean won is Rs 10.10 and the selling rate is Rs 10.14. One Swedish krona is being bought at Rs 15.98 and sold at Rs 16.04, while one Danish krone has a buying rate of Rs 22.83 and a selling rate of Rs 22.92. The buying rate of one Hong Kong dollar has been fixed at Rs 18.53 and the selling rate at Rs 18.60. The Kuwaiti dinar is set at Rs 473.99 for buying and Rs 475.95 for selling, the Bahraini dinar at Rs 383.97 for buying and Rs 385.56 for selling, and the Omani rial at Rs 376.08 for buying and Rs 377.63 for selling. Similarly, the buying rate of 100 Indian rupees has been fixed at Rs 160, while the selling rate is Rs 160.15. Nepal Rastra Bank stated that the exchange rates are subject to revision at any time as necessary. It also noted that exchange rates determined by commercial banks may vary, and updated rates are available on the central bank’s official website. Publish Date : 20 February 2026 07:25 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  },
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign exchange rates fixed for today",
    "description": "KATHMANDU: Nepal Rastra Bank (NRB) has published the official foreign exchange rates for today. According to the central bank, the buying rate of one US dollar has been fixed at Rs 144.47 and the selling rate at Rs 145.38. The buying rate of one euro stands a…",
    "url": "https://english.khabarhub.com/2026/19/535735/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-19T02:45:00+00:00",
    "content": "KATHMANDU: Nepal Rastra Bank (NRB) has published the official foreign exchange rates for today. According to the central bank, the buying rate of one US dollar has been fixed at Rs 144.47 and the selling rate at Rs 145.38. The buying rate of one euro stands at Rs 171.30 and the selling rate at Rs 172.01. Similarly, one UK pound sterling is being bought at Rs 196.47 and sold at Rs 197.29, while one Swiss franc has a buying rate of Rs 187.67 and a selling rate of Rs 188.45. Among other major currencies, the buying rate of one Australian dollar is Rs 102.40 and the selling rate is Rs 102.82. One Canadian dollar is being bought at Rs 106.05 and sold at Rs 106.49, while one Singapore dollar has a buying rate of Rs 114.15 and a selling rate of Rs 114.99. The buying rate of 10 Japanese yen is Rs 9.42 and the selling rate is Rs 9.46. One Chinese yuan is being bought at Rs 20.96 and sold at Rs 21.04. Likewise, one Saudi Arabian riyal has a buying rate of Rs 38.60 and a selling rate of Rs 38.76, while one Qatari riyal is being bought at Rs 39.61 and sold at Rs 39.78. According to the bank, the buying rate of one Thai baht is Rs 4.62 and the selling rate is Rs 4.64. One UAE dirham is being bought at Rs 39.42 and sold at Rs 39.58. The buying rate of one Malaysian ringgit is Rs 37.12 and the selling rate is Rs 37.28. Similarly, 100 South Korean won is being bought at Rs 10.03 and sold at Rs 10.07. One Swedish krona has a buying rate of Rs 16.11 and a selling rate of Rs 16.17, while one Danish krone is being bought at Rs 22.93 and sold at Rs 23.02. The buying rate of one Hong Kong dollar has been set at Rs 18.53 and the selling rate at Rs 18.60. One Kuwaiti dinar is being bought at Rs 474.22 and sold at Rs 476.19. Likewise, one Bahraini dinar has a buying rate of Rs 384.50 and a selling rate of Rs 385.64, while one Omani rial is being bought at Rs 376.80 and sold at Rs 377.63. The buying rate of 100 Indian rupees has been fixed at Rs 160.00 and the selling rate at Rs 160.15. Nepal Rastra Bank has stated that these rates may be revised at any time as necessary. It also noted that exchange rates set by commercial banks may vary. Updated rates are available on the central bank’s official website. Publish Date : 19 February 2026 08:00 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  },
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign currency exchange rates fixed for today",
    "description": "KATHMANDU: Nepal Rastra Bank has published the official foreign exchange rates for today. According to the central bank, the buying rate of one US dollar has been set at Rs 144.78 and the selling rate at Rs 145.38. The buying rate of one euro stands at Rs 171…",
    "url": "https://english.khabarhub.com/2026/18/535595/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-17T23:46:11+00:00",
    "content": "KATHMANDU: Nepal Rastra Bank has published the official foreign exchange rates for today. According to the central bank, the buying rate of one US dollar has been set at Rs 144.78 and the selling rate at Rs 145.38. The buying rate of one euro stands at Rs 171.48 and the selling rate at Rs 172.19. The UK pound sterling is being traded at a buying rate of Rs 196.72 and a selling rate of Rs 197.54, while the Swiss franc has a buying rate of Rs 188.18 and a selling rate of Rs 188.96. Similarly, the Australian dollar has been fixed at Rs 102.34 for buying and Rs 102.76 for selling. The Canadian dollar is set at Rs 106.16 (buying) and Rs 106.60 (selling), and the Singapore dollar at Rs 114.69 (buying) and Rs 115.17 (selling). The buying rate of 10 Japanese yen is Rs 9.46 and the selling rate Rs 9.50. The Chinese yuan is being exchanged at Rs 20.96 for buying and Rs 21.04 for selling. The Saudi Arabian riyal is fixed at Rs 38.60 (buying) and Rs 38.76 (selling), while the Qatari riyal stands at Rs 39.61 (buying) and Rs 39.78 (selling). According to the central bank, the Thai baht is priced at Rs 4.63 (buying) and Rs 4.65 (selling). The UAE dirham is set at Rs 39.42 (buying) and Rs 39.58 (selling), and the Malaysian ringgit at Rs 37.12 (buying) and Rs 37.28 (selling). The buying rate of 100 South Korean won is Rs 10.03 and the selling rate Rs 10.07. The Swedish krona has been fixed at Rs 16.13 (buying) and Rs 16.20 (selling), while the Danish krone stands at Rs 22.95 (buying) and Rs 23.05 (selling). Likewise, the Hong Kong dollar has a buying rate of Rs 18.53 and a selling rate of Rs 18.60. The Kuwaiti dinar is set at Rs 474.46 (buying) and Rs 476.42 (selling), the Bahraini dinar at Rs 384.06 (buying) and Rs 385.65 (selling), and the Omani rial at Rs 376.08 (buying) and Rs 377.63 (selling). The exchange rate for 100 Indian rupees has been fixed at Rs 160 for buying and Rs 160.15 for selling. Nepal Rastra Bank has stated that the exchange rates may be revised at any time as required. It also noted that rates offered by commercial banks may vary, and updated information is available on the central bank’s official website. Publish Date : 18 February 2026 05:11 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  },
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign currency exchange rates fixed for today",
    "description": "KATHMANDU: Nepal Rastra Bank has determined the foreign currency exchange rates for today. According to the central bank, the buying rate of one US dollar has been fixed at Rs 144.75 and the selling rate at Rs 145.35. Similarly, the buying rate of one euro st…",
    "url": "https://english.khabarhub.com/2026/17/535451/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-17T00:45:14+00:00",
    "content": "KATHMANDU: Nepal Rastra Bank has determined the foreign currency exchange rates for today. According to the central bank, the buying rate of one US dollar has been fixed at Rs 144.75 and the selling rate at Rs 145.35. Similarly, the buying rate of one euro stands at Rs 171.74 and the selling rate at Rs 172.45. The UK pound sterling is being traded at Rs 197.55 (buying) and Rs 198.37 (selling), while the Swiss franc is set at Rs 188.02 (buying) and Rs 188.80 (selling). The Australian dollar is priced at Rs 102.50 (buying) and Rs 102.92 (selling). The Canadian dollar stands at Rs 106.24 (buying) and Rs 106.68 (selling), and the Singapore dollar at Rs 114.70 (buying) and Rs 115.17 (selling). For Asian currencies, the buying rate of 10 Japanese yen is Rs 9.43 and the selling rate is Rs 9.47. The Chinese yuan is fixed at Rs 20.95 (buying) and Rs 21.04 (selling). The Saudi Arabian riyal is set at Rs 38.60 (buying) and Rs 38.76 (selling), while the Qatari riyal stands at Rs 39.60 (buying) and Rs 39.77 (selling). Likewise, the Thai baht is valued at Rs 4.65 (buying) and Rs 4.67 (selling). The UAE dirham is Rs 39.41 (buying) and Rs 39.57 (selling). The Malaysian ringgit is priced at Rs 37.07 (buying) and Rs 37.27 (selling). The South Korean won is Rs 10.03 (buying) and Rs 10.07 (selling). The Swedish krona stands at Rs 16.18 (buying) and Rs 16.25 (selling), while the Danish krone is fixed at Rs 22.99 (buying) and Rs 23.08 (selling). Among other currencies, the Hong Kong dollar is set at Rs 18.52 (buying) and Rs 18.60 (selling). The Kuwaiti dinar is Rs 474.36 (buying) and Rs 476.32 (selling), the Bahraini dinar is Rs 383.96 (buying) and Rs 385.55 (selling), and the Omani riyal is Rs 376.00 (buying) and Rs 377.56 (selling). The exchange rate for 100 Indian rupees has been fixed at Rs 160.00 (buying) and Rs 160.15 (selling). Nepal Rastra Bank has stated that these rates may be revised at any time as necessary. The exchange rates set by commercial banks may vary, and updated rates are available on the central bank’s official website. Publish Date : 17 February 2026 06:14 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  },
  {
    "source": "Khabarhub.com",
    "author": "Khabarhub",
    "title": "Foreign currency exchange rates for today",
    "description": "KATHMANDU: Nepal Rastra Bank (NRB) has set the foreign exchange rates for today. According to the central bank, the buying rate of one US dollar is Rs 144.72 and the selling rate is Rs 145.32. The buying rate of one euro stands at Rs 171.76, while the selling…",
    "url": "https://english.khabarhub.com/2026/16/535316/",
    "urlToImage": "https://english.khabarhub.com/wp-content/uploads/2024/04/FOREX-e1764984075308.webp",
    "publishedAt": "2026-02-16T01:41:08+00:00",
    "content": "KATHMANDU: Nepal Rastra Bank (NRB) has set the foreign exchange rates for today. According to the central bank, the buying rate of one US dollar is Rs 144.72 and the selling rate is Rs 145.32. The buying rate of one euro stands at Rs 171.76, while the selling rate is Rs 172.47. Similarly, the UK pound sterling is being traded at Rs 197.54 (buying) and Rs 198.35 (selling), and the Swiss franc at Rs 188.52 (buying) and Rs 189.31 (selling). The buying rate of one Australian dollar is Rs 102.39 and the selling rate is Rs 102.81. The Canadian dollar is fixed at Rs 106.27 (buying) and Rs 106.71 (selling), while the Singapore dollar stands at Rs 114.65 (buying) and Rs 115.12 (selling). For Asian currencies, 10 Japanese yen are valued at Rs 9.48 (buying) and Rs 9.52 (selling). The Chinese yuan is set at Rs 20.95 (buying) and Rs 21.03 (selling). The Saudi Arabian riyal is Rs 38.59 (buying) and Rs 38.75 (selling), while the Qatari riyal is Rs 39.70 (buying) and Rs 39.87 (selling). Likewise, the Thai baht is being traded at Rs 4.66 (buying) and Rs 4.68 (selling). The UAE dirham is fixed at Rs 39.40 (buying) and Rs 39.56 (selling), and the Malaysian ringgit at Rs 37.04 (buying) and Rs 37.19 (selling). The buying rate of 100 South Korean won is Rs 10.05 and the selling rate is Rs 10.09. The Swedish krona is set at Rs 16.22 (buying) and Rs 16.29 (selling), while the Danish krone stands at Rs 22.99 (buying) and Rs 23.09 (selling). Among other currencies, the Hong Kong dollar is valued at Rs 18.52 (buying) and Rs 18.59 (selling). The Kuwaiti dinar has a buying rate of Rs 474.26 and a selling rate of Rs 476.22. The Bahraini dinar is fixed at Rs 383.85 (buying) and Rs 385.44 (selling), while the Omani riyal is traded at Rs 375.92 (buying) and Rs 377.48 (selling). The buying rate of 100 Indian rupees has been set at Rs 160, and the selling rate at Rs 160.15. Nepal Rastra Bank has stated that these exchange rates may be revised at any time as necessary. It also noted that rates offered by commercial banks may vary, and the latest updates are available on the central bank’s official website. Publish Date : 16 February 2026 07:08 AM JHAPA: Senior Rastriya Swatantra Party (RSP) leader Balen Shah has DHADING: The bus that met with a fatal accident in MYAGDI: Construction has started on a 303-meter-long suspension bridge over KATHMANDU: The Department of Commerce, Supplies and Consumer Protection has KATHMANDU: Last week in Nepal unfolded as a dense convergence Reg No.: 1222/075-76(DOI, Nepal) Chairman: Naresh Shrestha Contact: +977 1-4249158"
  }
]