[
  {
    "source": "AlphaVantage: S&P Global",
    "title": "Global Economic Outlook: February 2026",
    "url": "https://www.spglobal.com/market-intelligence/en/news-insights/research/2026/02/global-economic-outlook-february-2026",
    "publishedAt": "2026-02-19T17:26:31+00:00",
    "content": "This February 2026 report from S&P Global analyzes the global economic outlook, highlighting the impact of geopolitical uncertainty on markets despite resilient economic conditions suggested by PMI data. It details key changes in their forecast, including higher real GDP growth projections for the US, India, and the eurozone, leading to an increased global growth forecast of 2.9% for 2026. The report also addresses consumer price inflation expectations, noting projected moderations driven by oil prices and easing underlying pressures, and discusses factors influencing US dollar depreciation an"
  },
  {
    "source": "AlphaVantage: AD HOC NEWS",
    "title": "Banco de Chile Stock: Quiet Latin Bank With U.S. Dollar Upside?",
    "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/banco-de-chile-stock-quiet-latin-bank-with-u-s-dollar-upside/68592281",
    "publishedAt": "2026-02-19T05:27:18+00:00",
    "content": "Banco de Chile’s stock has been sliding under Wall Street’s radar, even as dollar earnings look resilient and dividends stay rich. Here is what recent results and Chilean rate cuts could mean for U.S. income-focused investors now. Bottom line: If you are a U.S. investor hunting for bank exposure outside the crowded U.S. mega-cap names, Banco de Chile may deserve a fresh look. The Chilean lender is profitable, pays an above-average dividend, and gives you diversified Latin American exposure in U.S. dollars via its NYSE-listed ADR (BCH) – but its upside is tightly linked to Chile’s interest-rate cycle and the peso. You are not going to see Banco de Chile trending like the big U.S. money-center banks. Yet the combination of disciplined capital ratios, a conservative credit book, and a shareholder-friendly dividend policy has made it a quiet compounder for patient investors who can live with emerging-market volatility. More about the company What investors need to know now: how recent earnings, Chile’s aggressive interest-rate cuts, and a softer peso could reshape Banco de Chile’s dollar returns over the next 6–18 months. Banco de Chile is one of the country’s largest and most systemically important banks, focused on retail, SME, and corporate lending, plus treasury services. For U.S. investors, exposure typically comes through the BCH ADR listed on the NYSE, which represents local shares and trades in U.S. dollars. Over the past year, BCH has largely tracked a basket of Chilean financials and the performance of the Chilean peso (CLP) versus the U.S. dollar. When local rates were elevated, net interest margins fattened; as the Chilean central bank cut rates to support growth, margins normalized and the stock de?rated from peak levels. The company’s own investor materials stress a conservative risk culture: high capitalization, solid liquidity, and a well-seasoned retail loan book. This profile tends to hold up better during domestic slowdowns but leaves less explosive upside in boom times versus higher-beta Latin American peers. The following table summarizes the core aspects U.S. investors usually watch for a Latin American bank like Banco de Chile. Figures are indicative and should be cross-checked in the latest filings and earnings presentation before making decisions. The Chilean central bank has been one of the more proactive in Latin America in cutting interest rates after a period of high inflation. For Banco de Chile, this has two main implications. For U.S. investors, the critical question is whether the normalization of margins will be offset by improved loan growth and lower credit losses. Historically, Banco de Chile has managed such transitions reasonably well compared with more aggressive peers, but the adjustment typically weighs on valuation multiples in the near term. Banco de Chile’s ADR offers three things U.S. investors often look for when stepping outside domestic banks: However, those benefits come with emerging-market risks that U.S. investors must respect: currency swings, political noise, regulatory shifts, and lower trading liquidity than major U.S. bank stocks. Position sizing and time horizon are crucial. BCH typically shows only a moderate correlation with the S&P 500 and U.S. financial ETFs such as XLF or KBE. During global risk?off episodes, all risk assets tend to sell off together, but in normal periods, local Chilean factors drive a larger share of the price action. That means Banco de Chile can function as a diversifier in a U.S.-heavy portfolio, but it will not be immune to broad sentiment shifts around banks or emerging markets. U.S. treasury yields, the dollar index (DXY), and global commodity prices can all indirectly influence the stock. Recent earnings from major Chilean banks, including Banco de Chile, have shown a pattern common to many global lenders coming off a period of high rates: strong capital and solid credit quality, but normalized profitability as net interest margins retreat from unusual highs. On recent calls and in investor presentations, management has tended to emphasize: If Chile’s economy stabilizes and disinflation continues, that backdrop could support a more predictable earnings profile , albeit at lower margins than during the peak rate period. For investors, this transition usually favors longer-term income strategies over short-term trading. For any U.S. holder of Banco de Chile’s ADR, the Chilean peso is effectively a second layer of risk. Strong local earnings can be more than offset by a weaker CLP, while even flat profits can deliver solid dollar returns if the peso appreciates. For U.S. investors, the cleanest approach is to treat BCH as a combined bank plus FX trade : you are betting both on Banco de Chile’s execution and on a reasonably constructive medium-term view of the peso. Coverage of Banco de Chile by major Wall Street houses is more limited than that of large U.S. banks, but several global and regional brokers regularly update their views based on earnings, macro data, and Chilean policy moves. Recent analyst commentary from mainstream financial-data platforms indicates a generally neutral to moderately constructive stance on the stock, with the following key themes: Across the analyst spectrum, you are likely to see a blend of \"Hold\" and selective \"Buy\" ratings , often with target prices implying mid?single to low double?digit percentage upside from recent trading levels, before FX effects. Very few houses position it as a high?beta recovery play; instead, they frame it as a relatively defensive Latin American bank with income appeal. As always, investors should not rely on any single source. It is essential to cross?check analyst estimates, company guidance, and your own macro view on Chile and the peso before sizing a position. Before taking action, review Banco de Chile’s latest annual report, quarterly earnings presentations, and risk disclosures on its investor-relations page. These documents provide the most up?to?date, audited financial data and management commentary. Deep dive into Banco de Chile investor materials Want to see what the market is saying? Check out real opinions here: Disclosure: This article is for informational purposes only and does not constitute investment advice, an offer, or a solicitation to buy or sell any security. Always perform your own due diligence and consult a registered financial advisor before investing in foreign securities. Emotionale Kurzschlussreaktionen auf unruhige Märkte kosten dich bares Geld. Vertraue bei deiner Geldanlage stattdessen auf kühle Analysen und harte Fakten. Seit 2005 navigiert 'trading-notes' Anleger mit präzisen Handlungsempfehlungen sicher durch jede Marktphase. Hol dir dreimal pro Woche unaufgeregte Experten-Strategien in dein Postfach. 100% kostenlos. Jetzt abonnieren ."
  },
  {
    "source": "AlphaVantage: FXLeaders",
    "title": "Forex Signals Feb 19: Walmart (WMT), Alibaba, Rio Tinto and Gold Fields Earnings Preview",
    "url": "https://www.fxleaders.com/news/2026/02/19/forex-signals-feb-19-walmart-wmt-alibaba-rio-tinto-and-gold-fields-earnings-preview/",
    "publishedAt": "2026-02-19T01:20:13+00:00",
    "content": "Large companies in the retail, e-commerce, and global mining industries are releasing their earnings today, including Walmart Inc., Alibaba Group Holding Limited, Rio Tinto Group, and Gold Fields Limited. The U.S. dollar moved broadly higher yesterday, supported by a steady rise in Treasury yields and a series of better-than-expected economic releases. Momentum built throughout the session as investors digested fresh data alongside the latest FOMC minutes, reinforcing expectations that U.S. monetary policy will remain restrictive for longer. December durable goods orders declined 1.4%, but the drop was less severe than the expected 2.0% contraction. Broader data painted a firmer picture. Housing starts and building permits improved, industrial production rose 0.7% versus 0.4% expected, and manufacturing output climbed 0.6%, also beating forecasts. Collectively, the data suggested economic resilience despite tighter financial conditions. The January FOMC minutes leaned hawkish overall. While two officials dissented in favor of a 25-basis-point rate cut, most participants supported holding rates steady at 3.5%–3.75%. The minutes emphasized caution, with policymakers signaling little urgency to ease. Officials acknowledged the possibility of “two-sided” policy guidance, meaning rates could move in either direction if inflation progress stalls. Inflation forecasts were nudged slightly higher, and staff projections showed GDP running above potential growth through 2028. Policymakers warned that the path back to 2% inflation may be slower and more uneven, reinforcing the “higher for longer” narrative. Adding to inflation concerns, crude oil surged $2.90 (+4.66%) to $65.22, its largest Monday gain since June 17, amid escalating geopolitical tensions involving Iran. Treasury yields rose across the curve, with the 10-year reaching 4.0865%. Despite higher yields, equities extended gains. The Dow rose 0.28%, the S&P 500 advanced 0.56%, and the Nasdaq gained 0.70%, marking its second consecutive positive session. Today’s earnings lineup spans defensive retail, Chinese technology, and global mining—offering a broad read on consumer health, commodity demand, and global economic momentum. Walmart may provide insight into U.S. spending resilience, Alibaba into China’s recovery trajectory, while Rio Tinto and Gold Fields will reflect trends in industrial metals and precious commodities. Key question: Can Walmart sustain earnings momentum while managing cost pressures and competitive pricing? Given macro uncertainty and valuation sensitivity across sectors, forward guidance could matter more than headline earnings beats. Market reaction is likely to hinge not only on results, but on management confidence about demand, margins and capital discipline in the quarters ahead. Last week, markets were quite volatile again, with gold soaring to $4,550 and then retreating but finding support at $4,300. EUR/USD climbed above 1.18 while main indices closed the week higher at new records. The moves weren’t too big though, and we opened 35 trading signals in total, finishing the week with 28 winning signals and 9 losing ones. Although demand for safe haven assets is still high, gold fell precipitously from record highs following the Fed’s most recent rate cut comments, as profit-taking was prompted by Powell’s cautious tone. In December, gold jumped above $4.3800 following the Federal Reserve’s announcement of a 25 basis point rate decrease. But the impetus soon waned, and prices dropped back to $4,004. The 20 daily SMA (gray) held as support last week and buyers returned and pushed XAU above the $5,000 mark for the first time during Asian hours and extended the rally in New York, printing a fresh record high near $5,111 before retreating below $5,000 late in the session. But buyers returned and XAU climbed to $5,598 but pulled back below $5,000 again. Foreign exchange markets saw sharp swings. Early in the week, U.S. yield differentials and Japanese capital outflows pushed the dollar above ¥150, but disappointing U.S. jobs data triggered profit-taking, causing the USD/JPY to slide by four yen from its peak. However, the new BOJ governor the JPY has weakened and USD/JPY soared to 154 and we decided to close our buy signal for more than 80 pips as the pair found support at the 20 daily SMA (gray) and has rebounded more than 200 pips off that MA but reversed after the 25 bps rate cut from the FED. The price approached $160 but reversed after the BOJ meeting and fell 8 cents but found support at $152 at the 100 daily SMA (red) and rebounded above 156 but have reversed down again this week after the Japanese elections. Cryptocurrencies remained highly active over the summer. Bitcoin ( BTC ) climbed to fresh highs of $123,000 and $124,000 in July and August, supported by institutional inflows and technical strength. However, remarks from Treasury Secretary Scott Bessent ruling out U.S. increases to BTC reserves triggered a steep pullback, sending the coin down to $80K before finding support at the 100 weekly SMA (green). A rebound followed, sending BTC near $100 is the first major text for Bitcoin buyers. However BTC returned lower and fell below $80K, breaking below the but the 100 weekly SMA (green) but the decline stopped at the $60K support where the 200 weekly SM A(purpe) stands and rebounded above $70K. Ethereum ( ETH ) has been similarly strong, surging toward $4,800, its highest since 2021 and near its all-time peak of $4,860. Despite a dip last week, ETH found support at the 20-day SMA, with retail enthusiasm and renewed institutional participation driving fresh upside momentum. Last week we saw a dive below $2,000 but buyers returned n d pushed the price above $2K again."
  },
  {
    "source": "AlphaVantage: AD HOC NEWS",
    "title": "A Promising Opening for Vanguard's International Real Estate Fund",
    "url": "https://www.ad-hoc-news.de/boerse/ueberblick/a-promising-opening-for-vanguard-s-international-real-estate-fund/68589761",
    "publishedAt": "2026-02-18T17:23:35+00:00",
    "content": "Vanguard Global ex-U.S. Real Estate Index Fund ETF Shares US9220426764 The Vanguard Global ex-U.S. Real Estate ETF (VNQI) has entered the new year with considerable momentum. A combination of declining bond yields and a softer U.S. dollar is currently driving a notable revaluation of property markets outside the United States. This shift prompts the question of whether investors can now benefit from a lasting global trend reversal, following years of U.S. market dominance. Distinguishing itself through a strict geographic focus, the VNQI invests almost exclusively in real estate companies and REITs located outside American borders. Its portfolio is heavily diversified, holding 716 individual positions. Leading holdings include Australia's Goodman Group (3.65%), alongside Japanese giants Mitsui Fudosan (3.01%) and Mitsubishi Estate (2.72%), as well as Germany's Vonovia (2.34%). A key competitive advantage lies in its cost structure. With a total expense ratio (TER) of just 0.12%, it undercuts comparable products like the iShares Global REIT ETF (REET), which carries a 0.14% fee and includes U.S. holdings. While the REET distributes dividends quarterly, the VNQI follows an annual distribution schedule, yet currently offers the more attractive yield. The fundamentals for the real estate companies within the ETF have shown recent signs of stabilization. The price-to-book ratio (P/B) of its holdings has improved, climbing from 0.9 at the end of last year to a current level of 1.0. In February, the fund's dividend yield stood at a solid 4.27%. Furthermore, the inflation-linked indexing of rental contracts supports expectations for future dividend growth of approximately 3%. Essential VNQI metrics: * Dividend Yield: 4.27 % * Total Expense Ratio (TER): 0.12 % * Number of Holdings: 716 * Top Holding: Goodman Group (3.65 %) Should investors sell immediately? Or is it worth buying Vanguard Global ex-U.S. Real Estate Index Fund ETF Shares? Vanguard forecasts a long-term annual return potential of about 7.78% for this strategy. On Monday, the ETF's shares traded within a range of $50.08 to $50.65. The prospects for international real estate markets remain positive, as many securities continue to trade at a discount to their net asset values (NAV). Reduced interest rate volatility and stronger corporate balance sheets are enhancing earnings visibility for the remainder of the year. Looking further ahead, Vanguard identifies targeted opportunities in non-U.S. markets over the next five to ten years. While investments in artificial intelligence are primarily fueling growth in the United States, the resulting productivity gains are expected to increasingly benefit international sectors. For the VNQI, this environment highlights the combination of a stable dividend foundation and the potential for capital appreciation driven by a global recovery in property values. Vanguard Global ex-U.S. Real Estate Index Fund ETF Shares Stock: New Analysis - 18 February Fresh Vanguard Global ex-U.S. Real Estate Index Fund ETF Shares information released. What's the impact for investors? Our latest independent report examines recent figures and market trends. Read our updated Vanguard Global ex-U.S. Real Estate Index Fund ETF Shares analysis..."
  },
  {
    "source": "AlphaVantage: StoneX",
    "title": "Perspective: Morning Commentary February 18",
    "url": "https://www.stonex.com/en/market-intelligence/perspective-morning-commentary-february-18/",
    "publishedAt": "2026-02-18T13:57:45+00:00",
    "content": "This morning commentary by StoneX provides an update on the financial markets as of February 18. It covers the positive movement in the Dow Jones Industrials, S&P, and NASDAQ, anticipation for the January Fed minutes, and movements in treasury yields and the U.S. dollar. The article also discusses crude oil prices and the grain market, noting geopolitical risks and concerns over global crop conditions, particularly for wheat and soybeans."
  },
  {
    "source": "AlphaVantage: MSN",
    "title": "Infosys, HCL Tech, TCS, Tech Mahindra: Why IT stocks fell amid market rally today",
    "url": "https://www.msn.com/en-in/money/topstories/infosys-hcl-tech-tcs-tech-mahindra-why-it-stocks-fell-amid-market-rally-today/ar-AA1WT83k",
    "publishedAt": "2026-02-23T12:08:07+00:00",
    "content": "Indian IT stocks, including Infosys, HCL Tech, TCS, and Tech Mahindra, experienced a decline despite a broader market rally. This downturn is attributed to fears of a potential recession in the US and Europe, which are major markets for these companies, and the impending US Fed meeting that could result in another interest rate hike. Analysts suggest that the IT sector may face continued pressure in the near term."
  },
  {
    "source": "AlphaVantage: AD HOC NEWS",
    "title": "Is Goodyear Turkey the Overlooked Tire Play US Investors Missed?",
    "url": "https://www.ad-hoc-news.de/boerse/news/ueberblick/is-goodyear-turkey-the-overlooked-tire-play-us-investors-missed/68601880",
    "publishedAt": "2026-02-22T15:54:49+00:00",
    "content": "Goodyear’s Turkish arm sits at the crossroads of inflation, EV adoption, and global auto demand—yet most US investors have never priced it in. Here’s what’s really happening behind the ticker, and how it could affect your portfolio. Bottom line for your money: If you only follow US-listed Goodyear Tire & Rubber, you may be missing a separate, locally listed business in Turkey— Goodyear Lastikleri T.A.?. —that is exposed to a very different macro story: Turkish inflation, lira swings, and European auto demand. For US investors looking for niche exposure to emerging-market auto recovery or a read?through on global tire pricing, Goodyear’s Turkish operation is worth understanding—even if you never buy a single share in Istanbul. What investors need to know now about Goodyear Turkey and how it connects back to US portfolios… Goodyear Lastikleri T.A.?. is the Turkish tire manufacturing and distribution subsidiary of Goodyear Tire & Rubber Company. It is listed on Borsa ?stanbul, trades in Turkish lira, and publishes disclosures through the Public Disclosure Platform (KAP) and its own investor relations page. More about the company and its Turkish operations Recent public information on Goodyear Lastikleri T.A.?. has been relatively quiet in the global English-language financial press. Major data platforms such as Bloomberg, Reuters, Yahoo Finance, and MarketWatch list the stock mainly as part of the broader Goodyear group, but do not feature it prominently in US-facing coverage, and there is no active US ADR for the Turkish listing. That lack of coverage is precisely why this name can matter as a contrarian signal: the Turkish entity sits at the intersection of European vehicle demand, Turkish monetary policy, and Goodyear’s global cost base. From public sources, Goodyear Lastikleri T.A.?. is: In the broader macro backdrop, Turkey has been moving from years of ultra?loose policy and high inflation toward a more orthodox stance, with the central bank raising interest rates aggressively in an attempt to stabilize the lira and cool inflation. For a manufacturer like Goodyear Turkey, that means: Even when there is no headline-grabbing corporate news, these macro variables can drive significant volatility in the Turkish listing—which, in turn, can give you a window into how Goodyear’s EMEA business might be trending beneath the surface of the US?listed parent (ticker: GT). For context, here is a structural comparison between Goodyear’s Turkish subsidiary and the US?listed parent. Dollar figures and exact valuation metrics are not provided here to avoid fabricating data; instead, the table focuses on characteristics that can be validated from public disclosures and global newswires. 1. Macro read?through on tires and autos Even if you never trade Turkish equities, Goodyear Lastikleri T.A.?. is a live experiment in how a tire business behaves under high inflation and FX volatility—conditions that could re?emerge elsewhere if global inflation proves sticky. If the Turkish unit is able to protect margins with price hikes, mix upgrades, or cost controls, that playbook can inform expectations for the broader Goodyear group and even other global tire makers. 2. EMEA margin and volume signal for GT shareholders Goodyear’s EMEA business is an important segment for the US?listed parent. While the Turkish subsidiary is only one piece of that puzzle, its disclosures and any local commentary on demand trends can offer clues on: For a US investor in GT, following the Turkish disclosures is less about trading the local stock and more about gauging how resilient Goodyear’s EMEA earnings might be in the next few quarters. 3. Portfolio diversification and EM micro?exposure For more sophisticated US investors with access to international brokers that can route to Borsa ?stanbul, Goodyear Lastikleri T.A.?. could, in theory, offer targeted exposure to a cyclical manufacturing business in an emerging market aligned with NATO and the EU customs zone. That said, investors should be clear?eyed about the extra layers of risk: Across major global financial portals, there have been no widely reported, market?moving headlines about Goodyear Lastikleri T.A.?. in the last day or two that would fundamentally alter the long?term thesis. Instead, the focus remains on: Investors who track Turkish corporate disclosures directly via the company’s investor relations page and the KAP system can monitor for quarterly results, dividend decisions, and capital expenditure updates, all of which shape the medium?term risk/reward profile. On the sell?side, Wall Street coverage is concentrated on the US?listed Goodyear Tire & Rubber (GT) , not the Turkish local listing. Major houses such as Goldman Sachs, JPMorgan, and Morgan Stanley publish ratings and price targets on GT, using it as the main liquid vehicle for expressing views on Goodyear as a whole. For Goodyear Lastikleri T.A.?., coverage is typically provided by local Turkish or regional emerging?market brokers. These notes are often in Turkish and may be distributed mainly to institutional clients in the region rather than to US retail investors. Because those local recommendations are not consistently aggregated by US?focused platforms like Yahoo Finance or MarketWatch, and their detailed forecasts are often behind paywalls, it would be misleading to quote specific target prices or rating percentages here without verifiable, up?to?date numbers. Instead, US investors can use the following practical framework when reading any analyst commentary on the Turkish unit: For GT itself, consensus in the US market (as reported by large data aggregators) has in recent months reflected a cautiously optimistic stance tied to: Performance at subsidiaries like Goodyear Lastikleri T.A.?. will feed into how accurate those broader expectations prove to be. Without quoting unverified figures, US investors can still build a mental model for the Turkish subsidiary’s value contribution: In other words, you do not need an exact price target for Goodyear Lastikleri T.A.?. to decide whether GT in the US is a value, a trap, or a cyclical trade. You do, however, benefit from understanding how this subsidiary fits inside the global machine. Want to see what the market is saying? Check out real opinions here: Bottom line: Goodyear Lastikleri T.A.?. will never be as liquid or widely covered as GT in the US, but it is a useful lens on how a global tire giant navigates one of the most volatile major economies. For US investors, that lens can sharpen your view on cyclicality, pricing power, and risk in the broader Goodyear story—without having to chase every local headline. Seit 2005 liefert der Börsenbrief trading-notes verlässliche Trading-Empfehlungen – dreimal die Woche, direkt in dein Postfach. 100% kostenlos. 100% Expertenwissen. Trage einfach deine E-Mail Adresse ein und verpasse ab heute keine Top-Chance mehr. Jetzt abonnieren ."
  },
  {
    "source": "AlphaVantage: Barron's",
    "title": "The Yen Is Historically Undervalued. It’s Likely to Stay That Way.",
    "url": "https://www.barrons.com/articles/japanese-yen-value-51651847360?gaa_at=eafs&gaa_n=AWEtsqet7UXWIrCKMBz5VsrCGH76-qnkDP85isTYn0ZOnANYNSrYFBz1Re9S&gaa_ts=699af1fc&gaa_sig=hSjAGWYeMTIWQPqcb_Scp3IXS_xbpFnEJk5b_wehlHuONFhCN16NbtFr_exSVYr6YOoV3cjSWD7QH7gUa_ng5Q%3D%3D",
    "publishedAt": "2026-02-22T11:54:33+00:00",
    "content": "About the authors: Marc Chandler is chief market strategist for Bannockburn Global Forex, a division of First Financial Bank. Omkar Godbole is an independent foreign-exchange writer. The Japanese yen has dropped like a rock. The market has become convinced that—arguably, after a late start—the Federal Reserve has begun the most aggressive tightening cycle seen in a generation. Meanwhile, the Bank of Japan has signaled its resolve to cap its 10-year bond yield at 0.25% indefinitely. The yen depreciated 6% against the U.S. dollar in April, pushing the dollar above JPY131 for the first time in two decades. The demand for dollars has been so intense that at one point, it rose for 13 consecutive trading days. According to the Organization for Economic Cooperation and Development’s purchasing-power parity measure, the yen is now more undervalued against the dollar than at any point in over 30 years. While the yen is historically undervalued, the forces driving it lower aren’t exhausted. The divergence between U.S. and Japanese monetary policy is stark. The U.S. is tightening monetary policy aggressively, while Japan sits with an open-spigot monetary policy. There is a long-held belief that the world’s third-largest economy is export-driven. Hence, Japanese policy makers should prefer a weak yen. But, at best, this belief is a distorted echo of the past. At worst, it may be a profound misunderstanding. Last year, Japan ran an average monthly trade deficit of JPY139 billion (approximately $1.2 billion) compared with an average monthly surplus of JPY32 billion in 2020. Japan’s exports are around 17.5% of its gross domestic product, higher than the U.S. at 12%. But other advanced economies export a much greater share. Canada and the U.K. export about a quarter of their GDP, while Germany exports 47%. And while Japan still runs a current-account surplus, it isn’t driven by trade. Some would argue that the yen’s depreciation would make Japanese goods cheaper in the international market, thereby lifting its exports. But Japanese businesses have responded to the chronic pressure to appreciate the yen by offshoring. That new dynamic helps explain a recent Reuters survey that found corporate Japan is worried that the falling yen would weaken consumption and capital investments. The rolling 24-month correlation between the yen’s weakness and the performance of the Nikkei has fallen to its lowest level since 2005. In addition to the yawning divergence in monetary policy, Japan is being hit with a terms of trade shock. Higher energy, commodities, and food prices boost imports faster than the weaker yen boost exports. Moreover, the J-curve theory suggests that trade deficits initially worsen with currency depreciation, since prices adjust faster than quantities. The expected delayed positive impact on exports could be elusive, as the ongoing global policy tightening will likely cause demand destruction. The yen’s depreciation, however, will boost the value of current-account components like investment-related flows (dividends, coupons), profits, licensing fees, and royalties. What’s next for the yen? The Russian invasion of Ukraine was understood in economic terms as a disruption of supply, foodstuffs, energy, and some metals. We saw appreciation in commodity prices and currencies thought to be linked to commodities, such as the Australian and Canadian dollars, the South African rand, and many currencies in Latin America. But China and its Covid strategy is producing another wave of disruption as large parts of its economy are locked down again. The net result has been a demand shock. The divergence of monetary policy looks to be more persistent. Underlying it are different inflation experiences. The U.S. consumer price index rose 8.5% in its most recent reading, while Japan’s is still below 2%. U.S. inflation may be near a peak, but it will remain elevated. Data for April show Tokyo’s core CPI rose 1.9% over last year. The government pushed through a deflationary cut to cellphone charges in 2021, but that change will drop out of the 12-month comparison. Nevertheless, Bank of Japan Governor Haruhiko Kuroda argues that the increase in inflation won’t be sustainable and that the economy still needs extraordinary monetary accommodation. Some think that if the BOJ were to jettison its yield-curve control, the yen would strengthen. But where would the yield go? The 30-year Japanese government bond yields less than 1.0%. The exchange rate is also more correlated to the U.S. 10-year Treasury than to the 10-year Japanese government bond. While the BOJ under Kuroda seems to embrace the benefits of a weak yen, the Ministry of Finance is more concerned. The rhetoric has gradually become stronger. First, the ministry expressed concern about the pace of depreciation. Then it threatened External link to take appropriate action if needed. The ministry is climbing an escalation ladder. However, the bar to actual material intervention seems high. The yen’s weakness reflects fundamentals, the International Monetary Fund’s Asian-Pacific department head said recently External link . Intervention also seems to work best when it signals an adjustment of underlying policies, but that wouldn’t be the case now. It’s also unclear that the U.S. would appreciate dollar sales when the Federal Reserve is reducing monetary accommodation. Of course, Japan doesn’t need U.S. permission, but its blessing wouldn’t be so bad. Guest commentaries like this one are written by authors outside the Barron’s and MarketWatch newsroom. They reflect the perspective and opinions of the authors. Submit commentary proposals and other feedback to ideas@barrons.com External link ."
  },
  {
    "source": "AlphaVantage: Invesco",
    "title": "Why invest in emerging markets?",
    "url": "https://www.invesco.com/se/en/insights/why-invest-in-emerging-markets.html",
    "publishedAt": "2026-02-21T20:11:44+00:00",
    "content": "Emerging markets may be poised for outperformance compared to developed markets due to several factors. These include attractive valuations, the expectation of a weaker US dollar over a multi-year period, and emerging market authorities implementing more shareholder-friendly policies. The narrative around AI and evolving global trade relationships also present opportunities for EM companies, particularly in Asia."
  },
  {
    "source": "AlphaVantage: Invesco",
    "title": "Why invest in emerging markets?",
    "url": "https://www.invesco.com/fi/en/insights/why-invest-in-emerging-markets.html",
    "publishedAt": "2026-02-21T17:50:22+00:00",
    "content": "Invesco highlights emerging markets as a compelling investment opportunity for outperformance against developed markets, citing several structural and cyclical factors. Key reasons include attractive valuations, the anticipated weakening of the US dollar, and the implementation of more shareholder-friendly policies in EM regions, particularly in Asia and Korea. The article also touches on the potential benefits for emerging markets from artificial intelligence spending and shifting global trade dynamics."
  },
  {
    "source": "AlphaVantage: Morgan Stanley",
    "title": "2024 Global Economic Midyear Outlook",
    "url": "https://www.morganstanley.com/ideas/economic-outlook-mid-year-2024-steady-global-growth",
    "publishedAt": "2026-02-21T14:02:17+00:00",
    "content": "At Morgan Stanley, we lead with exceptional ideas. Across all our businesses, we offer keen insight on today's most critical issues. Learn from our industry leaders about how to manage your wealth and help meet your personal financial goals. At Morgan Stanley, we lead with exceptional ideas. Across all our businesses, we offer keen insight on today's most critical issues. From volatility and geopolitics to economic trends and investment outlooks, stay informed on the key developments shaping today's markets. At Morgan Stanley, we lead with exceptional ideas. Across all our businesses, we offer keen insight on today's most critical issues. Whether it’s hardware, software or age-old businesses, everything today is ripe for disruption. Stay abreast of the latest trends and developments. At Morgan Stanley, we lead with exceptional ideas. Across all our businesses, we offer keen insight on today's most critical issues. Our insightful research, advisory and investing capabilities give us unique and broad perspective on sustainability topics. At Morgan Stanley, we lead with exceptional ideas. Across all our businesses, we offer keen insight on today's most critical issues. Multicultural and women entrepreneurs are the cutting-edge leaders of businesses that power markets. Hear their stories and learn about how they are redefining the terms of success. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. We help people, businesses and institutions build, preserve and manage wealth so they can pursue their financial goals. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. We have global expertise in market analysis and in advisory and capital-raising services for corporations, institutions and governments. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. Global institutions, leading hedge funds and industry innovators turn to Morgan Stanley for sales, trading and market-making services. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. We offer timely, integrated analysis of companies, sectors, markets and economies, helping clients with their most critical decisions. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. We deliver active investment strategies across public and private markets and custom solutions to institutional and individual investors. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. We provide comprehensive workplace financial solutions for organizations and their employees, combining personalized advice with modern technology. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. We offer scalable investment products, foster innovative solutions and provide actionable insights across sustainability issues. Morgan Stanley helps people, institutions and governments raise, manage and distribute the capital they need to achieve their goals. From our startup lab to our cutting-edge research, we broaden access to capital for entrepreneurs and spotlight their success. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. Everything we do at Morgan Stanley is guided by our five core values: Do the right thing, put clients first, lead with exceptional ideas, commit to diversity and inclusion, and give back. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. Morgan Stanley leadership is dedicated to conducting first-class business in a first-class way. Our board of directors and senior executives hold the belief that capital can and should benefit all of society. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. From our origins as a small Wall Street partnership to becoming a global firm of more than 80,000 employees today, Morgan Stanley has been committed to clients and communities for 90 years. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. The global presence that Morgan Stanley maintains is key to our clients' success, giving us keen insight across regions and markets, and allowing us to make a difference around the world. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. Morgan Stanley is differentiated by the caliber of our diverse team. Our culture of access and inclusion has built our legacy and shapes our future, helping to strengthen our business and bring value to clients. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. Our firm's commitment to sustainability informs our operations, governance, risk management, diversity efforts, philanthropy and research. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. At Morgan Stanley, giving back is a core value—a central part of our culture globally. We live that commitment through long-lasting partnerships, community-based delivery and engaging our best asset—Morgan Stanley employees. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. As a global financial services firm, Morgan Stanley is committed to technological innovation. We rely on our technologists around the world to create leading-edge, secure platforms for all our businesses. Since our founding in 1935, Morgan Stanley has consistently delivered first-class business in a first-class way. Underpinning all that we do are five core values. At Morgan Stanley, we believe creating a more equitable society begins with investing in access, knowledge and resources to foster potential for all. We are committed to supporting the next generation of leaders and ensuring that they reflect the diversity of the world they inherit. We believe our greatest asset is our people. We value our commitment to diverse perspectives and a culture of inclusion across the firm. Discover who we are and the right opportunity for you. A career at Morgan Stanley means belonging to an ideas-driven culture that embraces new perspectives to solve complex problems. See how you can make meaningful contributions as a student or recent graduate at Morgan Stanley. We believe our greatest asset is our people. We value our commitment to diverse perspectives and a culture of inclusion across the firm. Discover who we are and the right opportunity for you. At Morgan Stanley, you’ll find trusted colleagues, committed mentors and a culture that values diverse perspectives, individual intellect and cross-collaboration. See how you can continue your career journey at Morgan Stanley. We believe our greatest asset is our people. We value our commitment to diverse perspectives and a culture of inclusion across the firm. Discover who we are and the right opportunity for you. At Morgan Stanley, our premier brand, robust resources and market leadership can offer you a new opportunity to grow your practice and continue to fulfill on your commitment to deliver tailored wealth management advice that helps your clients reach their financial goals. Global growth should stay steady at just over 3% in 2024 and 2025, though volatility will remain as a pickup in growth around the world contrasts with a slowdown in the U.S. Morgan Stanley Economists see global economic growth of 3.1% in 2024 and 2025. Global growth remains steady and inflation is slowing, despite data volatility and shifting rate expectations in the first half. Interest rate cuts are likely, with the European Central Bank expected to start cutting in June and the U.S. Federal Reserve following in September. Despite overall stability, the U.S. may experience a slowing, as growth elsewhere picks up. China is struggling with deflation but continuing to grow, and Japan remarkably has shifted from stagnation to growth. Investors can head into the second half of 2024 with optimism that a global recovery is under way and inflation has finally been tamed, with lower interest rates to follow. “Conflicting economic data in the first half of the year made it hard to determine where the global economy was headed, but there are now clear signals showing continued, steady growth,” says Seth Carpenter, Morgan Stanley’s Chief Global Economist. “We can expect some volatility as the global economy tries to find the lower gear that maintains forward momentum without reviving inflation. Still, we have nudged our 2024 global growth forecast to 3.1%, up from 2.8% in our November 2023 outlook.” While the reduction of inflation is a common theme, different countries are likely to see uneven growth, with some bumps along the way. The U.S., for instance, may experience a slowdown, diverging from the growth path of the rest of the world, while emerging markets could show higher levels of growth than the eurozone. Export-led economies are seeing improvement, with purchasing manager data in Europe and Asia signaling a bottom or the start of a moderate recovery. Here are the key trends for investors to watch. Investors waiting eagerly for lower interest rates are likely to finally get their wish. Morgan Stanley economists anticipate the European Central Bank will cut rates in June, with inflation on track to drop to its target levels around year’s end. The ECB is expected to cut 75 basis points this year and 100 basis points next year. The Bank of England is expected to start lowering the policy rate in August. The U.S. Federal Reserve, meanwhile, will likely start cutting its benchmark rate in September—a slower start than its European counterpart because of uneven data on inflation. Morgan Stanley’s forecast has the Fed cutting three times in 2024, reducing rates by a total of 75 basis points, followed by 100 basis points’ worth of cuts in 2025. The pace of the Fed’s path will be dictated by inflation data over the next two years. The trend, though, is that prices should continue to moderate, suggesting that inflation will fall to the Fed’s 2% target by the end of 2025. Meanwhile Asia emerging markets face a very modest easing path, as China holds rates low as it manages deflation and central bankers across the region are unlikely to move ahead of the Fed. Any rate trims in Latin America should also be shallow as deflation, albeit slowing, continues and central bankers will have to balance currency considerations as they ease policy rates. The U.S. economy is being pulled in several directions. As the Fed has kept interest rates higher for longer, businesses and consumers are feeling the pinch, slowing demand for goods and services. At the same time, elevated levels of immigration are providing a strong labor supply and productivity. Morgan Stanley economists anticipate U.S. growth of 2.6% in 2024 and 2.1% in 2025, compared with 2.5% in 2023. Year-over-year growth is likely to moderate toward the end of 2024 with fourth-quarter GDP growth of 2.1%, compared with 3.1% in the fourth quarter of 2023. “Despite our view for growth above 2% for the U.S. this year and next, we see slack building and, along with inflation coming down to Fed’s target, expect unemployment to reach 4.2% and 4.5% in the final quarters 2024 and 2025, compared with 3.7% in the fourth quarter of 2023,” says Chief U.S. Economist Ellen Zentner. A recovery in exports helped China achieve higher-than-expected growth in the first quarter of this year, but persistent deflation bringing down prices of goods and services will weigh on growth. The continued need to manage debt in the housing market, and as well as in the local governments that funded the real estate boom, means that fiscal expansion will be limited. In addition, the debt-deflation cycle and a soft labor market are suppressing domestic demand. Morgan Stanley expects 4.8% growth this year and 4.5% in 2025. In Japan, by contrast, decades of deflation are now over. The economy shifted in 2023 from stagnation to nominal growth—and a virtuous cycle in wages and prices. This allowed the Bank of Japan to end the negative interest rate policy it had had in place for eight years. The bullish case for Japan is playing out as predicted at the start of this year, with both domestic and foreign demand driving growth. Morgan Stanley believes this demand is outstripping the economy’s potential for production, creating a positive gap and sustaining inflation that had started primarily through higher prices for imported commodities. Morgan Stanley is forecasting 3.3% nominal GDP growth in 2024, down from 5.7% last year but still quite notable, in fact Japan’s nominal growth exceeded China’s last year—a result that would have seemed unthinkable just a few years ago. Growth in India already strong thanks to three megatrends of global offshoring, digitalization and energy transition, may become more broad-based across both consumer and business spending. Morgan Stanley forecasts 6.8% growth in 2024, and 6.5% next year, and thinks inflation will stay within policymakers’ comfort zone. The stronger global growth we are predicting benefits India, leading to higher income from exports and supporting domestic capital spending. There is potential for a faster-than-expected recovery in capital expenditures, driven by a stronger business environment and policy reforms. Sign up to get Morgan Stanley Ideas delivered to your inbox. Would you like to help us improve our coverage of topics that might interest you? Tell us about yourself. © 2026 Morgan Stanley. All rights reserved."
  }
]