[
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD holds ground as weak US GDP clashes with firm inflation data",
    "url": "https://www.fxstreet.com/news/eur-usd-holds-ground-as-weak-us-gdp-clashes-with-firm-inflation-data-202602201445",
    "publishedAt": "2026-02-20T14:45:37+00:00",
    "content": "The Euro (EUR) trades little changed against the US Dollar (USD) on Friday as investors digest the latest batch of US economic data. At the time of writing, EUR/USD hovers near 1.1763, recovering modestly from an intraday low of 1.1743, but remains on track for a weekly loss."
  },
  {
    "source": "www.fxstreet.com",
    "title": "Euro area: PMI recovery supports moderate growth – Commerzbank",
    "url": "https://www.fxstreet.com/news/euro-area-pmi-recovery-supports-moderate-growth-commerzbank-202602201426",
    "publishedAt": "2026-02-20T14:26:11+00:00",
    "content": "Commerzbank’s Dr. Vincent Stamer notes that the Euro area composite PMI rose to 51.9 in February, recovering about half of its recent decline and remaining in a range historically consistent with moderate growth. Sentiment improved particularly in manufacturing, while services edged higher."
  },
  {
    "source": "finance.yahoo.com",
    "title": "Treasury Yields Oscillate as U.S. GDP Slows Amid Sticky Inflation",
    "url": "https://finance.yahoo.com/m/79cf2aca-89af-35a9-b4b9-331211bb1548/treasury-yields-oscillate-as.html",
    "publishedAt": "2026-02-20T14:01:00+00:00",
    "content": "Treasury yields seesaw, with the two-year drifting higher and the 10-year yield slipping, as U.S. data point in different directions. Continue Reading"
  },
  {
    "source": "www.fxstreet.com",
    "title": "When is the US flash S&P Global PMI data and how could it affect EUR/USD?",
    "url": "https://www.fxstreet.com/news/when-is-the-us-flash-sp-global-pmi-data-and-how-could-it-affect-eur-usd-202602201225",
    "publishedAt": "2026-02-20T12:25:13+00:00",
    "content": "The preliminary United States (US) S&P Global Purchasing Managers’ Index (PMI) data for February is due for release today at 14:45 GMT."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/GBP weakens as robust UK data outweigh upbeat Eurozone PMI readings",
    "url": "https://www.fxstreet.com/news/eur-gbp-weakens-as-robust-uk-data-outweigh-upbeat-eurozone-pmi-readings-202602201224",
    "publishedAt": "2026-02-20T12:24:56+00:00",
    "content": "EUR/GBP trades lower on Friday as solid UK Retail Sales and stronger preliminary Purchasing Managers Index (PMI) data lift the British Pound (GBP). Although the stronger-than-expected Eurozone HCOB flash PMI failed to provide meaningful support to the Euro (EUR) and kept the cross under pressure."
  },
  {
    "source": "finance.yahoo.com",
    "title": "Exclusive | Lagarde Says Her ‘Baseline’ Is Finishing ECB Term",
    "url": "https://finance.yahoo.com/m/41bfd491-ff8b-3766-a76f-43064bc5f30a/exclusive-%7C-lagarde-says-her.html",
    "publishedAt": "2026-02-20T11:51:26+00:00",
    "content": "Christine Lagarde said she expects completing her mission as European Central Bank president to take until the end of her term, amid speculation that she will resign early. “When I look back at all these years, I think that we have accomplished a lot, that I have accomplished a lot,” she told The Wall Street Journal. Lagarde last year said she was determined to serve out her term after reports she had discussed leaving early to run the World Economic Forum. Continue Reading"
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD: January rally unwinds on ECB risks – MUFG",
    "url": "https://www.fxstreet.com/news/eur-usd-january-rally-unwinds-on-ecb-risks-mufg-202602201124",
    "publishedAt": "2026-02-20T11:24:47+00:00",
    "content": "MUFG’s Head of Research Derek Halpenny notes that EUR/USD has fully reversed its late-January rally, dropping about 2.5% back toward its opening 2026 level."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/JPY climbs on Eurozone growth, easing Japanese inflation",
    "url": "https://www.fxstreet.com/news/eur-jpy-climbs-on-eurozone-growth-easing-japanese-inflation-202602201043",
    "publishedAt": "2026-02-20T10:43:40+00:00",
    "content": "EUR/JPY trades around 182.75 on Friday at the time of writing, up 0.13% on the day, supported by stronger-than-expected activity data from the Eurozone and a slightly softer Japanese Yen (JPY) following cooling inflation figures."
  },
  {
    "source": "www.fxstreet.com",
    "title": "ECB: Euro area’s Negotiated Wages rise 2.95% YoY in Q4 vs. 1.89% in Q3",
    "url": "https://www.fxstreet.com/news/ecb-euro-areas-negotiated-wages-rise-295-yoy-in-q4-vs-189-in-q3-202602201005",
    "publishedAt": "2026-02-20T10:05:54+00:00",
    "content": "On Friday, the European Central Bank (ECB) released its indicator of the Euro area’s Negotiated Wage Rates data for the fourth quarter (Q4) of 2025."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD: Downside risk to 1.160 on oil shock – ING",
    "url": "https://www.fxstreet.com/news/eur-usd-downside-risk-to-1160-on-oil-shock-ing-202602200808",
    "publishedAt": "2026-02-20T08:08:29+00:00",
    "content": "ING’s Francesco Pesole sees the Euro vulnerable when Oil rises, despite some support from risk-off flows and its safe-haven role versus the Dollar."
  }
]