[
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD holds ground as weak US GDP clashes with firm inflation data",
    "url": "https://www.fxstreet.com/news/eur-usd-holds-ground-as-weak-us-gdp-clashes-with-firm-inflation-data-202602201445",
    "publishedAt": "2026-02-20T14:45:37+00:00",
    "content": "The Euro (EUR) trades little changed against the US Dollar (USD) on Friday as investors digest the latest batch of US economic data. At the time of writing, EUR/USD hovers near 1.1763, recovering modestly from an intraday low of 1.1743, but remains on track for a weekly loss."
  },
  {
    "source": "www.fxstreet.com",
    "title": "Euro area: PMI recovery supports moderate growth – Commerzbank",
    "url": "https://www.fxstreet.com/news/euro-area-pmi-recovery-supports-moderate-growth-commerzbank-202602201426",
    "publishedAt": "2026-02-20T14:26:11+00:00",
    "content": "Commerzbank’s Dr. Vincent Stamer notes that the Euro area composite PMI rose to 51.9 in February, recovering about half of its recent decline and remaining in a range historically consistent with moderate growth. Sentiment improved particularly in manufacturing, while services edged higher."
  },
  {
    "source": "finance.yahoo.com",
    "title": "Treasury Yields Oscillate as U.S. GDP Slows Amid Sticky Inflation",
    "url": "https://finance.yahoo.com/m/79cf2aca-89af-35a9-b4b9-331211bb1548/treasury-yields-oscillate-as.html",
    "publishedAt": "2026-02-20T14:01:00+00:00",
    "content": "Treasury yields seesaw, with the two-year drifting higher and the 10-year yield slipping, as U.S. data point in different directions. Continue Reading"
  },
  {
    "source": "www.fxstreet.com",
    "title": "When is the US flash S&P Global PMI data and how could it affect EUR/USD?",
    "url": "https://www.fxstreet.com/news/when-is-the-us-flash-sp-global-pmi-data-and-how-could-it-affect-eur-usd-202602201225",
    "publishedAt": "2026-02-20T12:25:13+00:00",
    "content": "The preliminary United States (US) S&P Global Purchasing Managers’ Index (PMI) data for February is due for release today at 14:45 GMT."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/GBP weakens as robust UK data outweigh upbeat Eurozone PMI readings",
    "url": "https://www.fxstreet.com/news/eur-gbp-weakens-as-robust-uk-data-outweigh-upbeat-eurozone-pmi-readings-202602201224",
    "publishedAt": "2026-02-20T12:24:56+00:00",
    "content": "EUR/GBP trades lower on Friday as solid UK Retail Sales and stronger preliminary Purchasing Managers Index (PMI) data lift the British Pound (GBP). Although the stronger-than-expected Eurozone HCOB flash PMI failed to provide meaningful support to the Euro (EUR) and kept the cross under pressure."
  },
  {
    "source": "finance.yahoo.com",
    "title": "Exclusive | Lagarde Says Her ‘Baseline’ Is Finishing ECB Term",
    "url": "https://finance.yahoo.com/m/41bfd491-ff8b-3766-a76f-43064bc5f30a/exclusive-%7C-lagarde-says-her.html",
    "publishedAt": "2026-02-20T11:51:26+00:00",
    "content": "Christine Lagarde said she expects completing her mission as European Central Bank president to take until the end of her term, amid speculation that she will resign early. “When I look back at all these years, I think that we have accomplished a lot, that I have accomplished a lot,” she told The Wall Street Journal. Lagarde last year said she was determined to serve out her term after reports she had discussed leaving early to run the World Economic Forum. Continue Reading"
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD: January rally unwinds on ECB risks – MUFG",
    "url": "https://www.fxstreet.com/news/eur-usd-january-rally-unwinds-on-ecb-risks-mufg-202602201124",
    "publishedAt": "2026-02-20T11:24:47+00:00",
    "content": "MUFG’s Head of Research Derek Halpenny notes that EUR/USD has fully reversed its late-January rally, dropping about 2.5% back toward its opening 2026 level."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/JPY climbs on Eurozone growth, easing Japanese inflation",
    "url": "https://www.fxstreet.com/news/eur-jpy-climbs-on-eurozone-growth-easing-japanese-inflation-202602201043",
    "publishedAt": "2026-02-20T10:43:40+00:00",
    "content": "EUR/JPY trades around 182.75 on Friday at the time of writing, up 0.13% on the day, supported by stronger-than-expected activity data from the Eurozone and a slightly softer Japanese Yen (JPY) following cooling inflation figures."
  },
  {
    "source": "www.fxstreet.com",
    "title": "ECB: Euro area’s Negotiated Wages rise 2.95% YoY in Q4 vs. 1.89% in Q3",
    "url": "https://www.fxstreet.com/news/ecb-euro-areas-negotiated-wages-rise-295-yoy-in-q4-vs-189-in-q3-202602201005",
    "publishedAt": "2026-02-20T10:05:54+00:00",
    "content": "On Friday, the European Central Bank (ECB) released its indicator of the Euro area’s Negotiated Wage Rates data for the fourth quarter (Q4) of 2025."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD: Downside risk to 1.160 on oil shock – ING",
    "url": "https://www.fxstreet.com/news/eur-usd-downside-risk-to-1160-on-oil-shock-ing-202602200808",
    "publishedAt": "2026-02-20T08:08:29+00:00",
    "content": "ING’s Francesco Pesole sees the Euro vulnerable when Oil rises, despite some support from risk-off flows and its safe-haven role versus the Dollar."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/GBP softens below 0.8750 on trade uncertainty",
    "url": "https://www.fxstreet.com/news/eur-gbp-softens-below-08750-on-trade-uncertainty-202602240621",
    "publishedAt": "2026-02-24T06:21:22+00:00",
    "content": "The EUR/GBP cross loses ground to near 0.8730 during the early European session on Tuesday. Renewed global trade concerns, including potential US tariff measures, weigh on the Euro (EUR) against the Pound Sterling (GBP)."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD Price Forecast: Bears Flirt with 61.8% Fibo. support near 1.1775 area",
    "url": "https://www.fxstreet.com/news/eur-usd-price-forecast-bears-flirt-with-618-fibo-support-near-11775-area-202602240448",
    "publishedAt": "2026-02-24T04:48:09+00:00",
    "content": "The EUR/USD pair extends the previous day's late pullback from the 1.1835 region and attracts some follow-through selling during the Asian session on Tuesday. Spot prices currently trade around the 1.1775-1.1770 area, down nearly 0.15% for the day amid a modest US Dollar (USD) strength."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/JPY Price Forecast: Remains above nine-day EMA near 182.50",
    "url": "https://www.fxstreet.com/news/eur-jpy-price-forecast-remains-above-nine-day-ema-near-18250-202602240247",
    "publishedAt": "2026-02-24T02:47:27+00:00",
    "content": "EUR/JPY pares its recent losses from the previous session, trading around 182.60 during the Asian hours on Tuesday. The technical analysis of the daily chart points to a potential bullish reversal, with the currency cross holding slightly above the upper boundary of the descending channel pattern."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD gains traction to near 1.1800 as tariff uncertainty weighs on US Dollar",
    "url": "https://www.fxstreet.com/news/eur-usd-gains-traction-to-near-11800-as-tariff-uncertainty-weighs-on-us-dollar-202602240040",
    "publishedAt": "2026-02-24T00:40:50+00:00",
    "content": "The EUR/USD pair holds positive ground around 1.1795 during the early Asian session on Tuesday. The US Dollar (USD) weakens against the Euro (EUR) amid US tariff uncertainty. The release of the US January Producer Price Index (PPI) report will be in the spotlight later on Friday."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/HUF: Forint carry to face NBH test – ING",
    "url": "https://www.fxstreet.com/news/eur-huf-forint-carry-to-face-nbh-test-ing-202602231557",
    "publishedAt": "2026-02-23T15:57:00+00:00",
    "content": "ING’s Frantisek Taborsky highlights a light CEE data calendar but focuses on Hungary, where the National Bank of Hungary is expected to restart its cutting cycle with a 25bp move to 6.25%."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/JPY trades lower as investors await Eurozone inflation, BoJ rate signals",
    "url": "https://www.fxstreet.com/news/eur-jpy-trades-lower-as-investors-await-eurozone-inflation-boj-rate-signals-202602231459",
    "publishedAt": "2026-02-23T14:59:27+00:00",
    "content": "EUR/JPY trades around 182.50 on Monday at the time of writing, down 0.15% on the day, as market participants adopt a wait-and-see approach ahead of key macroeconomic releases in Europe and Japan."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD: Bearish Dollar view to lift pair toward 1.22 – ING",
    "url": "https://www.fxstreet.com/news/eur-usd-bearish-dollar-view-to-lift-pair-toward-122-ing-202602231421",
    "publishedAt": "2026-02-23T14:21:56+00:00",
    "content": "ING’s FX team maintains a bearish Dollar baseline for 2026, expecting lower front-end US rates and softer US growth in the second half of the year to support EUR/USD."
  },
  {
    "source": "www.fxstreet.com",
    "title": "Euro area: Inflation risks tilt higher beyond 2026 – Nomura",
    "url": "https://www.fxstreet.com/news/euro-area-inflation-risks-tilt-higher-beyond-2026-nomura-202602231408",
    "publishedAt": "2026-02-23T14:08:17+00:00",
    "content": "Nomura’s Andrzej Szczepaniak expects Euro area HICP inflation to average just below the ECB’s 2.0% target in H1 2026, mainly on energy base effects, with little surprise versus consensus."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/GBP trades sideways as investors await Eurozone CPI and German GDP",
    "url": "https://www.fxstreet.com/news/eur-gbp-trades-sideways-as-investors-await-eurozone-cpi-and-german-gdp-202602231242",
    "publishedAt": "2026-02-23T12:42:13+00:00",
    "content": "EUR/GBP extends its range-bound trade on Monday, consolidating recent losses as repeated rejections near the multi-month resistance around 0.8750 continue to cap the upside."
  },
  {
    "source": "www.fxstreet.com",
    "title": "EUR/USD trims intraday gains; holds above 1.1800 as German IFO survey fails to inspire",
    "url": "https://www.fxstreet.com/news/eur-usd-trims-intraday-gains-holds-above-11800-as-german-ifo-survey-fails-to-inspire-202602230909",
    "publishedAt": "2026-02-23T09:09:38+00:00",
    "content": "The EUR/USD pair trims a part of its intraday gains, though it manages to hold above the 1.1800 mark through the first half of the European session on Monday and moves little following the release of the IFO institute's business survey for February."
  }
]