{
  "schema_version": 1,
  "fetched_at": "2026-02-18T17:59:36.711992+00:00",
  "pair": "EUR/USD",
  "request": {
    "endpoint": "https://newsapi.org/v2/everything",
    "params": {
      "q": "(\"EUR/USD\" OR \"EUR USD\" OR \"EURUSD\" OR (\"euro\" AND \"dollar\") OR (\"euro\" AND \"U.S. dollar\") OR (\"euro\" AND \"US dollar\")) AND (forex OR fx OR currency OR \"exchange rate\" OR \"central bank\" OR \"interest rate\" OR \"rate cut\" OR \"rate hike\")",
      "language": "en",
      "sortBy": "publishedAt",
      "pageSize": 10,
      "from": "2026-02-09",
      "to": "2026-02-16"
    }
  },
  "response": {
    "status": "ok",
    "totalResults": 116
  },
  "articles": [
    {
      "source": {
        "id": null,
        "name": "newsBTC"
      },
      "author": "Godspower Owie",
      "title": "XRP Ledger Positioned At The Heart Of Japan’s Next Financial Transformation",
      "description": "With a strong regulatory environment, proactive institutional participation, and a growing appetite for blockchain-powered financial solutions, Japan is positioning itself at the forefront of next-generation finance, and XRPL is increasingly becoming central …",
      "content": "Strict editorial policy that focuses on accuracy, relevance, and impartiality\n\nMorbi pretium leo et nisl aliquam mollis. Quisque arcu lorem, ultricies quis pellentesque nec, ullamcorper eu odio.\n\nWith a strong regulatory environment, proactive institutional participation, and a growing appetite for blockchain-powered financial solutions, Japan is positioning itself at the forefront of next-generation finance, and XRPL is increasingly becoming central to that vision.\n\nJapan is placing a huge bet on the XRP Ledger identity and leading protocol. Crypto analyst Stellar Rippler revealed on X that a senior banker from the Bank of Japan (BoJ), Kazuo Ueda, reportedly stated that SBI holdings has invested in XRP, XRP Ledger-native identity protocols, compliance, and lending projects. Meanwhile, that backdrop became even more significant when SBI Holdings CEO Yoshitaka Kitao said the firm holds hidden assets worth more than its officially disclosed 9% stake, which is valued at over $10 billion.\n\nInterestingly, the strategic direction becomes clearer when viewed through the lens of identity. Ripple’s president, Monica Long, has described decentralized identity on XRPL as a way to turn personal information into a secure, portable digital token that users can carry globally and selectively share, replacing reliance on centralized platforms.\n\nRelated Reading: XRP Ledger DEX Metrics Flash Strong Growth As Activity Touches New Key Levels\n\nThis vision is already taking shape at the infrastructure level. DNAOnChain’s XDNA applies this model with zero-knowledge proofs to transform identity and compliance data into verifiable zk-credentials. Also, these allow institutions to confirm eligibility and regulatory status without exposing sensitive information. However, the SBI’s hidden asset has extended beyond XRP, and it’s pointing toward the XRPL’s identity and zero-knowledge credential layer, where XDNA fits in as the infrastructure institutions needed.\n\nXRP is actively used as a bridge currency for liquidity on the XRP Ledger, alongside stablecoins, which are complementary. An analyst known as Vet on X has noted that recent activity on the XRPL DEX shows that RLUSD is being exchanged for EUROP, a euro-denominated stablecoin, with XRP acting as the bridge asset. By serving as an intermediary layer, XRP increases the liquidity of issued assets across the network.\n\nFurthermore, this design results in a proven, robust financial infrastructure that maximizes capital efficiency for everyday users and institutions. At the same time, market makers can make markets between the respective XRP pairs; they can hold the token because it is counterparty-free, which makes it the most efficient way to make markets.\n\nAccording to RippleBullWinkle, founder of Lux Lions NFT, the global foreign exchange market is moving roughly $9.6 trillion in daily volume.\n\nIn the meantime, industry insiders are projecting an on-chain FX system for local currency stablecoins from countries around the world, in which they can settle directly on-chain against the dollar stablecoins. This is where XRP’s original design becomes relevant, because XRP was literally built to function as a bridge asset between currencies.\n\nMy name is Godspower Owie, and I was born and brought up in Edo State, Nigeria. I grew up with my three siblings who have always been my idols and mentors, helping me to grow and understand the way of life.\n\nMy name is Godspower Owie, and I was born and brought up in Edo State, Nigeria. I grew up with my three siblings who have always been my idols and mentors, helping me to grow and understand the way of life.\n\nMy parents are literally the backbone of my story. They’ve always supported me in good and bad times and never for once left my side whenever I feel lost in this world. Honestly, having such amazing parents makes you feel safe and secure, and I won’t trade them for anything else in this world.\n\nI was exposed to the cryptocurrency world 3 years ago and got so interested in knowing so much about it. It all started when a friend of mine invested in a crypto asset, which he yielded massive gains from his investments.\n\nWhen I confronted him about cryptocurrency he explained his journey so far in the field. It was impressive getting to know about his consistency and dedication in the space despite the risks involved, and these are the major reasons why I got so interested in cryptocurrency.\n\nTrust me, I’ve had my share of experience with the ups and downs in the market but I never for once lost the passion to grow in the field. This is because I believe growth leads to excellence and that’s my goal in the field. And today, I am an employee of Bitcoinnist and NewsBTC news outlets.\n\nMy Bosses and co-workers are the best kinds of people I have ever worked with, in and outside the crypto landscape. I intend to give my all working alongside my amazing colleagues for the growth of these companies.\n\nSometimes I like to picture myself as an explorer, this is because I like visiting new places, I like learning new things (useful things to be precise), I like meeting new people - people who make an impact in my life no matter how little it is.\n\nOne of the things I love and enjoy doing the most is football. It will remain my favorite outdoor activity, probably because I'm so good at it. I am also very good at singing, dancing, acting, fashion and others.\n\nI cherish my time, work, family, and loved ones. I mean, those are probably the most important things in anyone's life. I don't chase illusions, I chase dreams.\n\nI know there is still a lot about myself that I need to figure out as I strive to become successful in life. I’m certain I will get there because I know I am not a quitter, and I will give my all till the very end to see myself at the top.\n\nI aspire to be a boss someday, having people work under me just as I’ve worked under great people. This is one of my biggest dreams professionally, and one I do not take lightly. Everyone knows the road ahead is not as easy as it looks, but with God Almighty, my family, and shared passion friends, there is no stopping me.\n\nDisclaimer: The information found on NewsBTC is for educational purposes\n\t\t\t\t\t\t\tonly. It does not represent the opinions of NewsBTC on whether to buy, sell or hold any\n\t\t\t\t\t\t\tinvestments and naturally investing carries risks. You are advised to conduct your own\n\t\t\t\t\t\t\tresearch before making any investment decisions. Use information provided on this website\n\t\t\t\t\t\t\tentirely at your own risk.\n\nXRP price extended losses and traded below $1.450. The price is now consolidating losses but faces hurdles near $1.4850 and...\n\nXRP might be trading well below the $2 price level, but this hasn’t stopped outrageous predictions from its supporters. One...\n\nJake Claver is again laying out the conditions he says must line up for XRP to reach triple digits, framing...\n\nStrict editorial policy that focuses on accuracy, relevance, and impartiality\n\nMorbi pretium leo et nisl aliquam mollis. Quisque arcu lorem, ultricies quis pellentesque nec, ullamcorper eu odio.\n\nNewsBTC is a cryptocurrency news service that covers bitcoin news today, technical analysis & forecasts for bitcoin price and other altcoins. Here at NewsBTC, we are dedicated to enlightening everyone about bitcoin and other cryptocurrencies.\n\nWe cover BTC news related to bitcoin exchanges, bitcoin mining and price forecasts for various cryptocurrencies .",
      "url": "http://www.newsbtc.com/xrp-news/xrp-ledger-at-the-heart-of-japan/",
      "urlToImage": "https://www.newsbtc.com/wp-content/uploads/2026/02/XRP-from-Adobe-Stock-37.jpg?fit=360%2C240",
      "publishedAt": "2026-02-16T23:30:41+00:00",
      "content_truncated": "With a strong regulatory environment, proactive institutional participation, and a growing appetite for blockchain-powered financial solutions, Japan is positioning itself at the forefront of next-ge… [+2984 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "Cointelegraph"
      },
      "author": "Cointelegraph by Turner Wright",
      "title": "Germany‘s central bank president touts stablecoin and CBDC benefits for EU",
      "description": "In a speech at the New Year’s Reception of the American Chamber of Commerce in Frankfurt, Deutsche Bundesbank President Joachim Nagel addressed concerns on stablecoins and CBDCs.",
      "content": "Joachim Nagel said euro-pegged stablecoins would offer the bloc more independence from US dollar-pegged coins soon to be allowed under the GENIUS Act.\n\nJoachim Nagel, president of Germany’s central bank, the Deutsche Bundesbank, supported the introduction of a euro-pegged central bank digital currency (CBDC) and euro-denominated stablecoins for payments.\n\nIn remarks prepared for a speech at the New Year’s Reception of the American Chamber of Commerce in Frankfurt on Monday, Nagel said EU officials were “working hard” toward the introduction of a retail CBDC. Euro-denominated stablecoins, according to the central bank president, could also contribute to “making Europe more independent in terms of payment systems and solutions.”\n\n“Notably, a wholesale CBDC would allow financial institutions to make programmable payments in central bank money,” said Nagel. “I also see merit in euro-denominated stablecoins, as they can be used for cross-border payments by individuals and firms at low cost.”\n\nNagel’s remarks come months after US President Donald Trump signed a bill into law establishing a framework for payment stablecoins in the country, potentially setting US dollar-pegged stablecoins on a path to challenge any possible rollout of a euro-pegged peer. The law is expected to be fully implemented 18 months after it was signed or 120 days after related regulations are finalized.\n\nRelated: ING Germany expands crypto ETP and ETN offerings with Bitwise, VanEck\n\nThe German central bank president’s comment on stablecoins did not include risks he mentioned last week at the Euro50 Group meeting. Nagel warned domestic monetary policy “could be severely impaired, not to mention that European sovereignty could be weakened” if US dollar-denominated stablecoins were to have a significantly larger market share than a euro-pegged coin.\n\nWashington lawmakers and White House officials have been meeting with representatives from the banking and crypto industries ahead of a potential vote on the CLARITY Act in the US Senate. The bill, expected to provide a comprehensive regulatory framework for digital assets, has been dividing many crypto industry and banking leaders due to its approach to stablecoin rewards, which has yet to be finalized in the legislation.\n\nMagazine: Brandt says Bitcoin yet to bottom, Polymarket sees hope: Trade Secrets",
      "url": "https://cointelegraph.com/news/germany-central-bank-president-stablecoins",
      "urlToImage": "https://images.cointelegraph.com/cdn-cgi/image/f=auto,onerror=redirect,w=1200/https://s3.cointelegraph.com/uploads/2026-02/019c6828-b20e-7baa-bce7-775548138457.jpg",
      "publishedAt": "2026-02-16T21:56:24+00:00",
      "content_truncated": "Joachim Nagel, president of Germanys central bank, the Deutsche Bundesbank, supported the introduction of a euro-pegged central bank digital currency (CBDC) and euro-denominated stablecoins for payme… [+1987 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "Crypto Briefing"
      },
      "author": "Editorial Team",
      "title": "Brent Johnson: Dedollarization is complex and unlikely, the Dollar Milkshake Theory reveals market impacts, and a currency crisis is mathematically inevitable | Bankless",
      "description": "The desire for dedollarization exists but is complex to achieve. The Dollar Milkshake Theory outlines how sovereign debt crises impact markets. US assets are predicted to outperform due to superior market structure.\nThe post Brent Johnson: Dedollarization is …",
      "content": "The desire for dedollarization exists but is complex to achieve. The Dollar Milkshake Theory outlines how sovereign debt crises impact markets. US assets are predicted to outperform due to superior market structure.\n\nBrent Johnson is CEO of Santiago Capital, an investment firm focused on macro strategy and capital allocation. He developed the Dollar Milkshake Theory in 2018 to explain how the US dollar absorbs global liquidity during debt crises, a framework that has guided his analysis of currency markets and capital flows over the past several years. Johnson has become a prominent voice on the structural dynamics of the dollar-based monetary system, including the role of the Eurodollar market and how emerging technologies like stablecoins may reshape dollar hegemony.\n\nThere’s no question that there is a quote unquote desire for dedollarization… but the ability to actually do it is dramatically different than the desire to do it\n\nThe dollar milkshake theory was really a framework for how I thought a sovereign debt crisis would affect markets and asset classes\n\nI thought the US dollar would go higher… that’s essentially what has played out from a directional standpoint but we never got the crisis.\n\nThey’ve been able to keep the plates spinning, kick the can down the road, and here we are.\n\nIt is a mathematical certainty that we will have a crisis… because of the design of our monetary system.\n\nA system that loans money into existence has to grow… there’s never enough money to pay off all the loans plus the interest.\n\nTheir job is to step in and kick the problem down the road.\n\nThe design of the system mandates growth.\n\nThey have to keep it from contracting and do it in a way that not only stops the contraction but then starts it to expand again.\n\nIf we have some kind of productivity boom… perhaps they can kick this thing down another five, ten, fifteen, twenty years.\n\nThose who continually bet against the central bank’s ability to kick the can down the road… are doing themselves a disservice.\n\nThe dollar has been a wrecking ball… it did drink the milkshake of other reserve currencies of the world since 2021.\n\nThere is no question that there is a quote unquote desire for dedollarization.\n\nThe world is more dependent upon dollars today than it ever has been in the past.\n\nThe euro dollar network… is the biggest network in history.\n\nThere’s a lot made about the dedollarization from a narrative.\n\nThe dollar was the global reserve currency… because it was the fastest, cheapest, most efficient.\n\nThere’s been very little dedollarization that has gone on… they’ve never actually done anything of material consequence.\n\nThis will ultimately end in the US dollar going much higher versus other fiat currencies.\n\nThe reason is not because the dollar is so great but because so many other parts of the world are in trouble.\n\nThe dollar going higher… is incredibly important… it’s what causes things to break.\n\nThe United States will not just sit by and let stablecoins take over everything and compete with the US dollar.\n\nIt’s really a way for the United States to extend the dollar network throughout the world.\n\nThe world voluntarily adopts the US dollar stablecoin as the preferred medium of exchange.\n\nIt’s a great stealth weapon that the United States can use as a tool.\n\nThe estimates for 5 to 10 trillion are not out of the realm of possibility.\n\nThe United States can use these stablecoins as a geopolitical weapon.\n\nThis was a bank run enabled by technology… that was one of the main reasons why SVB collapsed.\n\nThis accelerates the perhaps the violence of the Dollar Milkshake Theory.\n\nThey could dollarize the Venezuelan economy within a few days if not a few weeks.\n\nYou can go through the whole entire life cycle in forty-eight hours rather than forty-eight days.\n\nThis is established doctrine… it’s not a stretch to then put a new technology on top of that.\n\nWe are going through a global divorce between China and the United States.\n\nThe dollar will be the best of the worst fiat.\n\nI continue to favor the United States and its markets over the rest of the world.\n\nObviously having something that cannot be debased is important… I always recommend that people own gold.",
      "url": "https://cryptobriefing.com/brent-johnson-dedollarization-is-complex-and-unlikely-the-dollar-milkshake-theory-reveals-market-impacts-and-a-currency-crisis-is-mathematically-inevitable-bankless/",
      "urlToImage": "https://static.cryptobriefing.com/wp-content/uploads/2025/12/24141156/bankless-podcast-featured-800x420.png",
      "publishedAt": "2026-02-16T20:55:00+00:00",
      "content_truncated": "The desire for dedollarization exists but is complex to achieve. The Dollar Milkshake Theory outlines how sovereign debt crises impact markets. US assets are predicted to outperform due to superior m… [+10266 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "Theflightdeal.com"
      },
      "author": "The Flight Deal",
      "title": "American: Philadelphia – Dublin, Ireland. $477 (Basic Economy) / $677 (Regular Economy). Roundtrip, including all Taxes",
      "description": "A good sale to Dublin.American / British Airways / Finnair / Iberia's $677 fare is a regular economy fare with ONE checked bag and a normal size carry-onAmerican / British Airways / Finnair /",
      "content": "American / British Airways / Finnair / Iberia’s $677 fare is a regular economy fare with ONE checked bag and a normal size carry-on\n\nAmerican / British Airways / Finnair / Iberia also have a $477 fare, but it is a Basic Economy / Economy Light fare. These Basic Economy / Economy Light fares:\n\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted on our website and social media channels - all for about a nickel a day.\n\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted on our website and social media channels - all for about a nickel a day.\n\nInterested in Business Class, First Class or Premium Economy deals? Signup for our Premium Newsletter for about a quarter a day.\n\nInterested in Business Class, First Class or Premium Economy deals? Signup for our Premium Newsletter for about a quarter a day.\n\nSunset over the Grand Canal, Dublin, Ireland – Photo: Giuseppe Milo via Flickr , used under Creative Commons License (By 2.0)\n\nFor more of the latest cheap Philadelphia Flight Deals:\n\n* The Flight Deal will receive a commission if you use the Priceline, accommodation, car rental, activities, or travel insurance affiliate links to make a booking or apply and is approved for a credit card using our link above. Thank you for your continuing support.\n\nTo make sure you receive our latest deals, LIKE our The Flight Deal Facebook Page , follow us on Twitter @TheFlightDeal , Threads @TheFlightDeal or The Flight Deal WhatsApp channel or subscribe to The Flight Deal RSS Feed or Subscribe via Email (Once a Day)\n\nThe Flight Deal does not sell travel products or services. We provide  you with information about third-party travel suppliers’ offers, and  link you to their sites. The information posted by The Flight Deal is  valid at the time of publication. However, we have no control over the  suppliers, and we therefore do not warrant or guarantee that their  offers will not change or become unavailable. Nor are we responsible for  their products, services or site content. Please see their sites for  their most up-to-date offer information and all applicable terms and  conditions.\n\nSign up to receive The Flight Deal Daily DealsLetter, to stay up to date with the latest and greatest flight deals available.\n\nSave my name, email, and website in this browser for the next time I comment.",
      "url": "https://www.theflightdeal.com/2026/02/16/american-philadelphia-dublin-ireland-477-basic-economy-677-regular-economy-roundtrip-including-all-taxes/",
      "urlToImage": "https://www.theflightdeal.com/wp-content/uploads/2014/08/dublin_august-640x390.jpg",
      "publishedAt": "2026-02-16T17:53:52+00:00",
      "content_truncated": "A good sale to Dublin.\r\nAmerican / British Airways / Finnair / Iberias $677 fare is a regular economy fare with ONE checked bag and a normal size carry-on\r\nAmerican / British Airways / Finnair / Iber… [+4320 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "GlobeNewswire"
      },
      "author": "VICAT",
      "title": "Vicat - FY 2025 Results",
      "description": "Robust revenue growth of +3.3% like-for-like1 in 2025, accelerating in Q4 (+8.1%)Cement business stabilized in France, recovery in Switzerland, and strong...",
      "content": "February 16, 2026 12:00 ET | Source: VICAT VICAT\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nGuy Sidos, Chairman and Chief Executive Officer, commented:\n\n“In a complex international environment characterized by headwinds and adverse exchange rate effects, the Group delivered solid results in 2025, following a record year in 2024. This performance underscores the resilience of our business model, which is built on a balanced presence across developed and emerging markets, as well as a local-to-local approach. It also demonstrates the importance of the long-term vision of our corporate strategy, and the unwavering commitment of our employees across 12 countries. In 2025, the Group achieved strong free cash flow generation for the third consecutive year and continued the disciplined execution of its roadmap, with an EBITDA margin of 20%, a significant reduction in net debt, and further progress on decarbonization. In this respect, the progress made toward obtaining European and French subsidies for VAIA, our flagship carbon capture project in France, marks an important milestone. The outlook for 2026 is positive, underpinned by the ramp-up of kiln 6 in Senegal, the integration of Realmix in Brazil, the TELT project and the first signs of a gradual recovery in France.”\n\nThe consolidated financial statements for the year ended 2025 were approved by the Board of Directors at its meeting on 13 February 2025. The audit procedures on the consolidated financial statements have been performed. The auditors’ report on the consolidated financial statements is in the process of being issued.\n\nActivity: acceleration in the fourth quarter brings full-year 2025 organic sales growth to +3.3%\n\nThe Group’s consolidated sales reached €3,854 million in 2025, up +3.3% on a like-for-like basis. Growth accelerated gradually throughout the year, reaching +8.1% on a like-for-like basis in the fourth quarter.\n\nOn a reported basis, sales showed a limited decline of -0.8% in 2025, including:\n\nIn 2025, the Group’s business was marked by a stabilization of cement volumes in France at the end of the year at a historically low level, a sustained recovery in Switzerland throughout the year, as well as a slowdown in the US market. Emerging countries reported a marked improvement in their activity, particularly in Brazil and the Mediterranean region. By contrast, trends in Asia and Africa were more mixed.\n\nEBITDA: +3.7% increase in 2025 on a like-for-like basis; 5.9% unfavorable exchange rate impact\n\nGroup EBITDA reached €771 million in 2025, up +3.7% on a like-for-like basis, in line with the guidance of +2% to +5% communicated in July 2025. This performance reflects strong growth in the Mediterranean region and in Brazil, improvement in Switzerland and Africa, and stabilization in France, despite a marked slowdown in the United States. On a reported basis, EBITDA contracted slightly by ‑1.6%, including an unfavorable exchange rate effect of ‑€46 million and a scope effect of +€4 million.\n\nThe Group’s EBITDA margin stood at 20.0%, virtually unchanged from its 2024 level. Like-for-like EBITDA growth in 2025 was driven by a positive volume effect of +€18 million, in cement and aggregates, as well as by an improvement in the price/cost differential:\n\nIndustrial performance improved in the Cement business, notably driven by an increase in the use of alternative fuels, as a substitute for fossil energy, which rose by +1.4 points compared with 2024, reaching 37.4%.\n\nRecurring EBIT amounted to €445 million, down -2.7% in 2025 (up +4.0% on a like-for-like basis), with the margin declining by -30 basis points.\n\nFurther increase in consolidated net income\n\nNet financial income amounted to -€55 million in 2025, an improvement of €17 million compared to 2024. This change primarily reflects the lower cost of net debt, which improved by €23 million, driven by a reduction in the average debt volume and lower interest rates, net of hedging. However, this was partially offset by a reduction in the contribution from other financial income and expenses, down by €6 million.\n\nThe tax charge is €24 million higher than in 2024. The effective tax rate stands at 28.0%, significantly higher than the 24.7% recorded in 2024. This overall increase in the tax charge was due to the rise in pre-tax income from ordinary activities, as well as to non-recurring items (charges on dividends, exceptional tax contribution in France, etc.).\n\nConsolidated net income amounted to €307 million, up 11.9% on a like-for-like basis and +5.7% on a reported basis. The net margin was 8.0%, up +50 basis points.\n\nNet income, Group share rose by +6.0% on a like-for-like basis and +0.8% on a reported basis. The change in Net income Group’s share, compared to that of consolidated net income, was due to the increase in income attributable to minority interests. This increase reflects the significantly improved performance of subsidiaries in Brazil, Egypt, and Turkey.\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nFrance posted solid, resilient results in a context where residential market is at its lowest level in 25 years. After stabilizing in the third quarter, cement sales showed a modest recovery in the fourth quarter of 2025. Cement prices remained stable throughout the year. The TELT project also made a positive contribution to sales. The Group has joined forces with the Belgian group Koramic to create a new industrial entity, 60% owned by Vicat, bringing together 7 sites in France around the Vicat Produits Industriels (VPI) and Cermix brands. This structuring operation is designed to sustainably strengthen the Group’s position in construction chemicals in France.\n\nIn Europe (excluding France), results improved in 2025, driven by the solid performance of the Cement and Concrete & Aggregates businesses in Switzerland, as well as by the appreciation of the Swiss franc against the euro. The Cement business in Switzerland grew thanks to higher volumes driven by the recovery of the Swiss market, Vigier’s exposure to several major infrastructure projects, and the commercial success of Vigier’s low-carbon cement (Progresso). The Concrete & Aggregates business also benefited from the ramp-up of the Flumenthal treatment unit, whose operating efficiency made a significant contribution to improving costs.\n\nResults in the Americas region were impacted by the slowdown in the United States, despite solid performance in Brazil. In the United States, continued weakness in the residential market, coupled with political uncertainty, weighed on the Cement and Concrete businesses. In Brazil, business accelerated throughout the year, driven by favorable market momentum and sustained commercial development in the Midwest region. The acquisition of Realmix in concrete, integrated from 1 September 2025, also made a positive contribution to growth in cement volumes towards the end of the year. Unfavorable exchange rate evolution had a negative impact on the region’s performance.\n\nThe Group’s results in Asia decreased, due to a challenging competitive environment in India that weighed on pricing, as well as higher energy costs in Kazakhstan that impacted profitability. After a difficult first half, the Cement business in India showed signs of improvement in the second half of the year, supported by volume growth thanks to a favorable base effect and targeted commercial initiatives. However, prices were highly volatile throughout the year. The depreciation of the Indian rupee and Kazakh tenge against the euro also weighed on the region’s performance.\n\nResults from the Mediterranean region rose sharply, driven by continued strong export momentum in Egypt—now reinforced by a recovery in domestic demand—and by accelerating market activity in Turkey. Prices were well-oriented both in Turkey, to offset the effects of inflation, and in Egypt. Performance in the region was once again impacted by the sharp depreciation of the Turkish and Egyptian currencies against the euro during the period.\n\nThe Group’s results in Africa improved in 2025, boosted by the initial effects of the ramp-up of kiln 6 in the fourth quarter and the acceleration of the Aggregates business in Senegal, despite the impact of political upheaval on activity in Mali. In Senegal, the Cement business was impacted by a decline in domestic prices early in the year, following the entry of a new market participant. However, this pressure on prices was partially offset by a gradual improvement in volumes during the year. The Aggregates business in Senegal benefited from the resumption of several major public works projects, notably the accelerated construction of the Port of Ndayane, south of Dakar.\n\nA more detailed analysis of performance by region is provided in the appendix to this press release.\n\nInvestment and cash generation: another year of strong free cash flow\n\nIn 2025, net capital expenditure amounted to €299 million, down from €320 million in 2024. This amount included strategic growth investments, notably the final disbursement related to kiln 6 in Senegal. The Group also seized land opportunities in Turkey and France to secure long-term mineral reserves.\n\nFor the third consecutive year, the Group delivered strong free cash flow generation, amounting to €324 million in 2025. Free cash flow was nevertheless lower than in 2024 (€373 million), primarily due to an unfavorable exchange rate effect, non-recurring items in the second half (including a CAPN 2 -related disbursement), and higher-than-expected net capital expenditure.\n\nFinancial position: further net debt reduction\n\nAs of 31 December 2025, the Group’s financial structure remains robust, with a high level of shareholders’ equity and a year-on-year €85 million reduction in net debt. The leverage ratio stood at 1.49x, compared to 1.58x as of 31 December 2024.\n\nThe Group had €877 million in undrawn confirmed financing lines not allocated to the coverage of liquidity risk on NEU CP as of 31 December 2025, compared to €847 million at 31 December 2024. These financing lines guarantee a high level of liquidity for the Group.\n\nThe Group’s climate performance in 2025 was characterized by progress on all indicators. The alternative fuels rate, up for the fifth consecutive year, corresponds to 1.7 million tonnes of alternative fuels consumed, replacing 1.2 million tonnes of coal.\n\nIn France, the reduction of the clinker factor below the 80% threshold—driven in particular by the contribution of the DECA low-carbon range and the increase in the substitution rate to over 70% (+5 points year-on-year) made a significant contribution to the decrease in specific emissions in Europe.\n\nIn the United States, the contribution from Ragland’s more efficient kiln 2 and the switch to type 1L cement in California and the Southeast contributed to improvements in both the alternative fuel rate and the clinker factor. The alternative fuel rate also rose sharply in India thanks to the start-up of new solid recovered fuel preparation facilities in Bharathi and Kalburgi, as well as the diversification of supply sources.\n\nHowever, the evolution of the Group’s geographic sales mix (higher exports in Egypt and volume growth in Mumbai in India, etc.) limited the reduction in the clinker rate in 2025.\n\nFor the 2025 financial year, the Board of Directors will propose a dividend of €2.0 per share at the next General Meeting, unchanged from 2024, representing a yield of 2.6% 3 .\n\nThe Vicat Group stands out for its stable and predictable distribution policy, as its dividend has never been reduced over the past 30 years.\n\nOn 12 February 2026, the VAIA (Vicat Advanced Industrial Alliance) project was awarded a GPID grant by the French government. This recognition follows on from the public sector support obtained after the project was selected for funding under the European Innovation Fund program in November 2025. In total, the Group has been awarded €340 million in subsidies, including support from the Innovation Fund and GPID, for an investment currently estimated at €700 million, excluding subsidies. The agreements for these subsidies should be finalized in the coming months. The GPID grant is part of the French government’s Major Investment Plans to accelerate the country’s ecological and industrial transition. This program aims to support innovative and structuring projects, particularly those that contribute to the decarbonization of industry, the modernization of infrastructure, and the competitiveness of strategic sectors.\n\nIn 2026, growth momentum is set to continue, despite persistent macroeconomic and geopolitical uncertainties. Against a backdrop of volatile exchange rates, the Group has set the following targets for 2026 :\n\nSlight growth in sales on a like-for-like basis\n\nSlight growth in EBITDA on a like-for-like basis\n\nNet capital expenditure of around €290 million\n\nThe Vicat Group also confirms its medium-term priorities:\n\nIn France , after showing signs of stabilization in the second half of 2025, the residential construction market is expected to continue its soft landing, with a gradual and moderate recovery from 2026 onwards. However, visibility remains limited in an uncertain political context, and with municipal elections scheduled for March. In Switzerland , the market should continue to recover thanks to solid economic fundamentals and very low interest rates. Major infrastructure projects in France and Switzerland should bolster business. The gradual integration of the cost of decarbonization should support the favorable price trends in Europe.\n\nIn the United States , against a backdrop of persistent macroeconomic and geopolitical uncertainties, visibility for 2026 remains limited. A recovery in the residential construction market is only likely to materialize once mortgage interest rates have decreased. On the non-residential market, a slight recovery is expected, supported by a more favorable base effect from April onwards, in an economic environment that remains resilient. Cement pricing should help absorb the impact of inflation. The weakness of the dollar is expected to continue to weigh on Group’s results.\n\nBusiness in emerging countries should remain well-oriented despite persistent negative exchange rate effects, particularly in the Mediterranean region. In Egypt , growth is set to continue at a more moderate pace, driven by exports and an improving domestic market. In Turkey , despite the backdrop of persistent hyperinflation, momentum should remain favorable, supported by public spending and a positive base effect in the first quarter. In Brazil , Realmix’s contribution should support growth in cement volumes over the first part of 2026. In India , despite a positive base effect in the first quarter, visibility remains limited, with prices likely to remain volatile, particularly in the South where the competition is more intense. Senegal is expected to benefit from the full-year contribution of kiln 6, along with sustained momentum in the Aggregates business.\n\nPresentation meeting and conference call\n\nIn connection with this publication, the Vicat Group will hold an information conference call in English on 17 February 2026 at 3 pm CET Paris (2 pm London and 9 am New York).\n\nThis conference call will be webcast on Vicat’s website or directly via the following link:\n\nA recording of this conference call will be immediately available for replay on Vicat’s website or via the same link.\n\nFor 170 years, Vicat has been a leading player in the mineral and biosourced building materials industry. Vicat is a group listed on the Euronext Paris market, part of the SBF 120 Index, and is under the majority control of its founding family. With the ambition of achieving carbon neutrality in its value chain by 2050, the Vicat Group now operates three core lines of business: Cement, Ready-Mixed Concrete and Aggregates, as well as related activities. The Vicat Group is present in 12 countries spanning both developed and emerging markets. It has close to 10,000 employees and generated consolidated sales of €3,854 million in 2025. With its strong regional positions, Vicat is developing a circular economy model beneficial for all and consistently innovating to reduce the construction industry’s environmental impact.\n\nMore comprehensive information about Vicat is available on its website at www.vicat.fr .\n\nDefinition of alternative performance measures (APMs)\n\nSimplified consolidated financial statements 2025\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nAfter stabilizing at a low level in the third quarter, the cement business in France began a modest recovery in the fourth quarter. While this performance is encouraging, visibility remains limited, particularly in view of the political context and the municipal elections scheduled for March, which are likely to weigh on the small infrastructure segment. The residential market continues its soft landing, and the recovery in housing construction in France is expected to remain gradual and moderate in 2026. Cement prices remained stable throughout 2025. On the Lyon–Turin infrastructure project (TELT), the first boring machine has been operating on the French side since the end of the year, with three additional boring machines scheduled for commissioning between mid-2026 and 2027—developments that are expected to support and accelerate cement consumption on this major project. Against this backdrop, operational sales for the Cement business stabilized over the full year at -0.3%. After a difficult first half of the year, EBITDA recovered in the second half, taking full-year growth to +5.3%. This increase reflects the improvement in volumes in the second half of the year, amplified by positive operational leverage and strict cost control.\n\nOperational sales for the Concrete & Aggregates business declined slightly in 2025, down -3.0% on a constant scope basis, reflecting lower concrete and aggregates volumes over the year, while prices remained broadly stable. The concrete and aggregates markets remain contrasted, with marked regional disparities. EBITDA fell by -10.4%, mainly due to lower volumes and inflation in fixed costs.\n\nOperational sales for Other Products & Services rose by +15.5% on a reported basis, thanks to the scope effect related to the integration of Cermix into the construction chemicals division (VPI). At constant scope, the construction chemicals and transportation businesses remained broadly stable over the year. EBITDA for Other Products & Services rose by +8.3% on a reported basis. This evolution mainly reflects the dilutive effect of the integration of Cermix, whose margin rate is nevertheless expected to improve as synergies are delivered.\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nThe Cement business in Switzerland grew in 2025, driven by higher volumes linked to the market recovery, as well as Vigier’s exposure to several major infrastructure projects (renovation of the Weissenstein tunnel, construction of the Gléresse tunnel). The commercial success of Vigier’s low-carbon cement, particularly the Progresso range, also contributed positively, supported by the launch of flagship projects. Prices decreased in the first part of the year, due to a less favorable customer mix, and stabilized in the second half of 2025. Operational sales for the Cement business were up +7.8% on a like-for-like basis, and +9.6% on a reported basis, thanks to the appreciation of the Swiss franc against the euro. EBITDA rose +7.3% on a like-for-like basis.\n\nOperational sales for the Concrete & Aggregates business rose by +13.1% on a reported basis in 2025, driven by good momentum in aggregates over the full year and an acceleration in concrete sales in the second half. Prices remained resilient over the period. EBITDA rose by +16.4%, driven in particular by the ramp-up of the Flumenthal aggregates treatment unit, whose operating efficiency contributed significantly to cost improvements.\n\nOperational sales for Other Products & Services in Switzerland declined by -6.8% on a like-for-like basis in 2025, impacted by an unfavorable base effect for Vigier Rail (delivery in 2024 of an exceptional project following the accident in the Gotthard Tunnel). EBITDA declined by -17.4% over the period.\n\nIn Italy , operational sales fell by -5.7%, following lower volumes in the second half, against a backdrop of very slight price erosion. EBITDA decreased by only -4.7% thanks to strict cost control.\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nIn the United States , cement sales showed contrasting trends: volumes were down in California, with growth in the Southeast only partially compensating for this. The residential market was affected by persistently high mortgage rates, while the non-residential market suffered from a climate of uncertainty linked to changes in tax and tariff policies implemented by the US administration in 2025. The pricing environment remained overall stable over the year, despite a slight erosion in the Southeast. Against this backdrop of uncertainty, Cement operational sales fell by -6.3% on a like-for-like basis in 2025, and -10.3% on a reported basis, impacted by the dollar’s depreciation against the euro from the second quarter of 2025. EBITDA declined by -19.3% on a reported basis, reflecting lower volumes and unfavorable operational leverage.\n\nConcrete operational sales in the United States were down -9.9% on a like-for-like basis, and -13.7% on a reported basis, due to the slowdown in California, despite higher prices. EBITDA declined sharply, reflecting both a negative volume effect and higher input costs (aggregates).\n\nIn Brazil , the Cement business accelerated throughout the year, driven by good market momentum and solid business development in the Midwest region, in Brasília and the state of Goiás. The contribution of Realmix, consolidated since September, also supported growth in cement volumes. Cement prices rose in the second half of the year, following a slight downturn in the first half. Cement operational sales rose by +13.3% on a like-for-like basis and by +4.7% on a reported basis in 2025, impacted by the depreciation of the Brazilian real against the euro. EBITDA rose by +4.0% (+12.5% on a like-for-like basis), thanks in particular to good control of variable costs, especially energy costs.\n\nThe Concrete & Aggregates business in Brazil benefited from strong sales momentum, with higher volumes including the contribution from Realmix and sharply rising prices across both segments. Operational sales therefore rose by +19.1% on a like-for-like basis and by +21.1% on a reported basis. The negative exchange rate effect partially offset the positive impact of the consolidation of Realmix since September 2025. EBITDA rose +18.4% (+27.1% on a like-for-like basis).\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nAfter a difficult first half of the year, the Cement business in India recovered in the second half, driven by higher volumes, thanks to a favorable base effect and targeted commercial initiatives. Over the full year 2025, the decline in volumes remained limited, with contrasting trends across regions: volumes up in Maharashtra, buoyed by demand in Mumbai, and down in the southern states. Prices were highly volatile, reflecting a still tense competitive environment in the South amid ongoing market consolidation. Over 2025, operational sales were down -4.6% on a like-for-like basis, and -12.3% on a reported basis, penalized by the depreciation of the Indian rupee against the euro. EBITDA fell by -20.1% (-13.0% on a like-for-like basis). This trend reflects a deterioration in the pricing environment and a decline in volumes, despite effective cash cost control at Kalburgi, supported in particular by a sharp increase in the alternative fuel rate.\n\nIn Kazakhstan , selling prices rose in 2025, only partially offsetting higher fuel and energy costs. Volumes rose very slightly over the year, driven mainly by domestic demand, while exports declined over the period. Operational sales rose +17.0% like-for-like and +0.8% on a reported basis owing to the depreciation of the tenge against the euro over the period. EBITDA fell by -20.5% (-7.7% on a like-for-like basis).\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nAgainst a backdrop of persistent hyperinflation, Cement business in Turkey accelerated sharply from the second quarter onwards, buoyed by the recovery of the infrastructure and building markets, and supported by government initiatives to boost public spending in the Ankara region and rebuild areas affected by the February 2023 earthquake. Selling prices rose significantly to absorb the impact of inflation on production costs. Against this backdrop, Cement operational sales grew by +33.9% on a like-for-like basis, compared with a -2.9% decline on a reported basis, penalized by the sharp depreciation of the Turkish lira against the euro. EBITDA rose sharply by +44.9% in 2025 (+99.7% on a like-for-like basis), driven by strict cost control and improved operating performance at the Bastas plant.\n\nConcrete & Aggregates operational sales in Turkey improved by +19.4% like-for-like (down -13.4% on a reported basis due to exchange rate). EBITDA fell by -77.4% (-68.8% on a like-for-like basis). Price increases in concrete and aggregates only very partially offset inflation in production costs, with regards to both wages and energy.\n\nThe Cement business in Egypt benefited from sustained export momentum, with volumes rising sharply over the full year, as well as a rebound in the domestic market in the second half, driven in particular by several ongoing megaprojects, including the Ras El Hekma and Al Sahel real estate developments. Export prices rose in the first half before stabilizing in the second. Although down on the peak seen in June, prices in the domestic market remained well-oriented throughout the year. In this context, operational sales rose by +41.1% like-for-like and by +24.4% on a reported basis, impacted by the depreciation of the Egyptian pound against the euro. EBITDA surged by +78.5% (+102.5% on a like-for-like basis).\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\nIn 2025, the Cement business in Senegal was impacted by a deterioration in selling prices in the domestic market due to the entry of a new competitor at the end of 2024, despite moderate growth in volumes. Thus, Cement operational sales in Senegal contracted by -2.7% over the full year. EBITDA grew by +0.5%, mainly driven by the ramp-up of kiln 6 in the fourth quarter, which eliminates the need for clinker purchases and allows for the shutdown of kilns 3 and 4, resulting in improved production costs. Kiln 6 continues to ramp up and should reach its nominal capacity in the coming months, contributing to the gradual improvement in margins.\n\nAggregates operational sales in Senegal rose by +26.7% over the full year, driven by a sharp increase in volumes from the second quarter onwards, following the resumption of several major public works projects. The acceleration of construction work on the port of Ndayane, located south of Dakar, also boosted activity. Prices rose slightly over the period. As a result, EBITDA rose sharply by +55.0% in 2025.\n\nIn Mali , business was severely penalized by a difficult local environment. Volumes were down, affected by power outages and a shortage of transporters, which are disrupting supplies and shipments. Cement operational sales contracted by -34.1%, while EBITDA was down -25.7% in 2025.\n\nCement operational sales in Mauritania were stable overall at +0.9% on a reported basis in 2025, as was EBITDA (+0.6%).\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\n* Like-for-like, i.e. at constant scope and exchange rates\n\n1 At constant scope and exchange rates 2 Nuclear Generation Allocation Contract signed with EDF in the third quarter of 2025 3 Calculated on the basis of the share price at 31 December 2025 4 Including €29 million in proceeds from the sale of a plot of land in Senegal 5 ROCE = Recurring EBIT after tax / Capital employed 6 Operating Cash flow = Net income – other non-cash income (operating, financial and exceptional write-backs) – income from asset disposals + other non-cash expenses (operating, financial and exceptional allowances) + net book value of assets sold – share of investment subsidies transferred to income for the year 7 Cash conversion rate = free cash flow / EBITDA\n\nThe Vicat Group awarded a “Grand Projets Industriels de Décarbonation” (GPID) grant for its VAIA project    The VAIA (Vicat Advanced Industrial Alliance) project has been awarded a GPID grant by the...\n\nHalf yearly report on the liquidity contract as of 31/12/2025between VICAT and Kepler Cheuvreux  Under the liquidity contract entrusted by VICAT to Kepler Cheuvreux, the following resources appeared...",
      "url": "https://www.globenewswire.com/news-release/2026/02/16/3238827/0/en/Vicat-FY-2025-Results.html",
      "urlToImage": "https://ml-eu.globenewswire.com/Resource/Download/168df33c-7fc1-4fbf-89c4-e3ded3c895c0",
      "publishedAt": "2026-02-16T17:00:00+00:00",
      "content_truncated": "<ul><li>Robust revenue growth of +3.3% like-for-like1 in 2025, accelerating in Q4 (+8.1%)</li><li>Cement business stabilized in France, recovery in Switzerland, and strong growth in the Mediterranean… [+46334 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "Theflightdeal.com"
      },
      "author": "The Flight Deal",
      "title": "Iberia: Miami – Madrid, Spain. $426 (Basic Economy) / $626 (Regular Economy). Roundtrip, including all Taxes",
      "description": "A good sale to Madrid.American / British Airways / Finnair / Iberia's $626 fare is a regular economy fare with ONE checked bag and a normal size carry-on includedAmerican / British Airways / F",
      "content": "American / British Airways / Finnair / Iberia’s $626 fare is a regular economy fare with ONE checked bag and a normal size carry-on included\n\nAmerican / British Airways / Finnair / Iberia also have a $426 fare, but it is a Basic Economy / Economy Light fare. These Basic Economy / Economy Light fares:\n\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted on our website and social media channels - all for about a nickel a day.\n\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted on our website and social media channels - all for about a nickel a day.\n\nInterested in Business Class, First Class or Premium Economy deals? Signup for our Premium Newsletter for about a quarter a day.\n\nInterested in Business Class, First Class or Premium Economy deals? Signup for our Premium Newsletter for about a quarter a day.\n\nAtocha Station, Madrid, Spain – Photo: Mathew Black via Flickr , used under Creative Commons License (By 2.0)\n\nIberia is a member of the Oneworld Alliance and American partner. Mileage earning with American is as follows:\n\nFor more of the latest cheap Miami / Fort Lauderdale Flight Deals:\n\n* The Flight Deal will receive a commission if you use the Iberia, accommodation, car rental, activities, or travel insurance affiliate links to make a booking or apply and is approved for a credit card using our link above. Thank you for your continuing support.\n\nTo make sure you receive our latest deals, LIKE our The Flight Deal Facebook Page , follow us on Twitter @TheFlightDeal , Threads @TheFlightDeal or The Flight Deal WhatsApp channel or subscribe to The Flight Deal RSS Feed or Subscribe via Email (Once a Day)\n\nThe Flight Deal does not sell travel products or services. We provide  you with information about third-party travel suppliers’ offers, and  link you to their sites. The information posted by The Flight Deal is  valid at the time of publication. However, we have no control over the  suppliers, and we therefore do not warrant or guarantee that their  offers will not change or become unavailable. Nor are we responsible for  their products, services or site content. Please see their sites for  their most up-to-date offer information and all applicable terms and  conditions.\n\nSign up to receive The Flight Deal Daily DealsLetter, to stay up to date with the latest and greatest flight deals available.\n\nSave my name, email, and website in this browser for the next time I comment.",
      "url": "https://www.theflightdeal.com/2026/02/16/iberia-miami-madrid-spain-426-basic-economy-626-regular-economy-roundtrip-including-all-taxes/",
      "urlToImage": "https://www.theflightdeal.com/wp-content/uploads/2017/02/madrid_spain_february-640x390.jpg",
      "publishedAt": "2026-02-16T15:23:08+00:00",
      "content_truncated": "A good sale to Madrid.\r\nAmerican / British Airways / Finnair / Iberias $626 fare is a regular economy fare with ONE checked bag and a normal size carry-on included\r\nAmerican / British Airways / Finna… [+4433 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "CoinDesk"
      },
      "author": "Will Canny, AI Boost",
      "title": "From Wall Street to Web3: This is crypto’s year of integration, Silicon Valley Bank says",
      "description": "From bank-led stablecoins to tokenized T-bills and AI-powered wallets, digital assets will move from pilot projects to financial plumbing this year.",
      "content": "Last year restored crypto’s institutional footing. This year, according to Silicon Valley Bank (SVB), is when it becomes more integrated into the financial system.\n\nRegulatory clarity improved in 2025, institutional engagement accelerated and capital markets reopened. Now the focus is shifting from price cycles to infrastructure as digital assets become more deeply embedded into payments, custody, treasury management and capital markets.\n\n\"Regardless of how tangible or visible, all the forces shaping crypto today share a common thread: Crypto is moving from expectations to production. Pilot programs are scaling and capital is consolidating,\" Anthony Vassallo, senior vice president of crypto at SVB, told CoinDesk in an interview.\n\nThe bank, which maintains more than 500 relationships with crypto companies and venture firms investing in the sector, says institutional capital, consolidation, stablecoins, tokenization and AI are converging to reshape how money moves.\n\nAfter its 2023 collapse , SVB was bought by North Carolina–based First Citizens Bank and now operates within a top-20 U.S. bank with $230 billion in assets. In 2025, it added 2,100 clients and ended the year with $108 billion in total client funds and $44 billion in loans.\n\n“The suits and ties have arrived,” according to the bank's 2026 outlook report .\n\nVenture funding in U.S. crypto companies rose 44% last year to $7.9 billion, according to PitchBook data cited by SVB. While the deal count fell, median check sizes climbed to $5 million as investors concentrated capital into stronger teams. Seed valuations jumped 70% from 2023 levels.\n\nThe bank warns that demand for institutional-grade crypto companies could outstrip the number of investable firms.\n\n\"In 2026, conditions are ripe for continued growth in VC investment in crypto. As institutional adoption accelerates, driving larger venture capital checks, we expect continued capital concentration in fewer companies with investors prioritizing higher-quality projects and follow-ons into proven teams,\" Vassallo said.\n\n\"For end users, the result will be a more seamless experience across everyday financial interactions, from sending cross-border payments to managing an investment portfolio.\"\n\nCorporate balance sheets are reinforcing the shift. At least 172 public companies held bitcoin BTC $ 67,111.88 in the third quarter of 2025, up 40% from the second, collectively controlling roughly 5% of circulating supply, according to data referenced by SVB.\n\nA new class of digital asset treasury companies, firms that treat crypto accumulation as a core strategy, has emerged. The bank expects consolidation as standards tighten and volatility tests business models .\n\nMeanwhile, traditional banks are moving deeper into the sector. JPMorgan, the largest U.S. bank by assets, plans to accept bitcoin and ether (ETH) as collateral, Bloomberg reported last year. SoFi Technologies offers direct digital asset trading . U.S. Bank provides custody through NYDIG. SVB expects more institutions to roll out lending, custody and settlement products as compliance guardrails solidify.\n\nMore than 140 venture capital-backed crypto companies were acquired in the four quarters ending in September, a 59% year-over-year jump, according to the bank's analysis of PitchBook data. Coinbase’s $2.9 billion acquisition of Deribit and Kraken’s $1.5 billion purchase of NinjaTrader underscored the scale.\n\nThe trend extends to banking charters. In 2025, 18 companies applied for charters from the Office of the Comptroller of the Currency (OCC), most of them blockchain-enabled firms. The OCC granted conditional approval to digital-asset-focused trust banks including custody provider BitGo (BTGO), Circle Internet (CRCL), the company behind the second-largest stablecoin, trading platform Fidelity Digital Assets, stablecoin issuer Paxos and payments network Ripple.\n\nFor SVB, that marks a turning point: stablecoin and custody infrastructure moving inside the federal banking perimeter. The bank expects traditional financial institutions to accelerate dealmaking rather than risk being disrupted by vertically integrated crypto-native rivals.\n\n\"We expect M&A to set a record again in 2026. As digital asset capabilities become table stakes for financial services, companies will focus on acquisition strategies instead of building products from scratch,\" Vassallo says.\n\n\"To meet market demands ranging from stablecoin capabilities to full-stack crypto banks, exchanges, custodians, infrastructure providers and brokerages will consolidate into multiproduct companies,\" he said.\n\nStablecoins, SVB said, are evolving from trading tools into digital cash.\n\nWith near-instant settlement and lower transaction costs than interbank transfer system ACH or card networks, dollar-backed tokens are attractive for treasury operations, cross-border payments and business-to-business settlement.\n\nRegulatory clarity is accelerating adoption. The U.S. GENIUS Act , passed in July, established federal standards for stablecoin issuance, including 1:1 reserve backing and monthly disclosures. Similar frameworks are in place in the EU, U.K., Singapore and the UAE.\n\nBeginning in 2027, only permitted entities such as banks or approved nonbanks will be allowed to issue compliant stablecoins in the U.S. SVB expects issuers to spend 2026 aligning products with federal oversight.\n\nBanks are already experimenting. Société Générale introduced a euro stablecoin . JPMorgan expanded JPM Coin to public blockchains . A group including PNC, Citi and Wells Fargo is exploring a joint token initiative .\n\nVenture dollars are following. Investment in stablecoin-focused companies surged to more than $1.5 billion in 2025, up from less than $50 million in 2019, according to SVB.\n\nIn 2026, the bank expects tokenized dollars to move into core enterprise systems, embedded in treasury workflows, collateral management and programmable payments.\n\nReal-world asset tokenization is scaling. Onchain representations of cash, Treasuries and money-market instruments exceeded $36 billion in 2025, according to data cited by the bank.\n\nFunds from BlackRock (BLK) and Franklin Templeton have amassed hundreds of millions in assets, settling flows directly onchain. ETF issuers and asset managers are testing blockchain-based wrappers to reduce transfer costs and enable intraday settlement. Robinhood (HOOD) now has tokenized stock exposure for European users and plans U.S. expansion.\n\nSVB sees private and public markets converging on shared settlement rails, with tokenization expanding beyond Treasuries into private markets and consumer-facing applications.\n\nThen there's the convergence with AI. In 2025, 40 cents of every venture dollar invested in crypto went to companies also building AI products, up from 18 cents the year prior, according to SVB’s analysis. Startups are building agent-to-agent commerce protocols, and major blockchains are integrating AI into wallets.\n\nAutonomous agents capable of transacting in stablecoins could enable machines to negotiate and settle payments without human intervention. Blockchain-based provenance and verification tools are being developed to address AI’s trust deficit.\n\nThe consumer impact may be subtle. SVB predicts that next year's breakout apps won’t brand themselves as crypto. They will look like fintech products, with stablecoin settlement, tokenized assets and AI agents operating quietly in the background.\n\nSilicon Valley Bank’s overarching message is to treat crypto as infrastructure.\n\nPilot programs are scaling. Capital is concentrating. Banks are entering. Regulators are defining the perimeter. Blockchain technology is poised to underpin treasury operations, collateral flows, cross-border payments and parts of capital markets.\n\nVolatility will remain, and headlines will continue to move prices. But the deeper narrative, the bank argues, is about the plumbing.\n\n\"In 2025, momentum in onchain representations of cash, treasuries and money market instruments carried real-world assets into the financial mainstream,\" Vassallo said. \"This year, cryptocurrency will be treated as infrastructure.\"\n\nRead more: R3 bets on Solana to bring institutional yield onchain\n\nCoinbase’s Base moves away from Optimism’s 'OP stack' in major tech shift\n\nBase launched in 2023 and quickly became one of the most widely used Ethereum layer-2 networks.",
      "url": "https://www.coindesk.com/business/2026/02/16/from-wall-street-to-web3-this-is-crypto-s-year-of-integration-silicon-valley-bank-says",
      "urlToImage": "https://cdn.sanity.io/images/s3y3vcno/production/462aa44fc614504ef506e076687060227de07a47-1919x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
      "publishedAt": "2026-02-16T15:00:00+00:00",
      "content_truncated": "Last year restored cryptos institutional footing. This year, according to Silicon Valley Bank (SVB), is when it becomes more integrated into the financial system.\r\nRegulatory clarity improved in 2025… [+8053 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": "financial-post",
        "name": "Financial Post"
      },
      "author": "Bloomberg News",
      "title": "Euro-Area Finance Chiefs Push for Bigger Role of Single Currency",
      "description": "Euro-area finance chiefs are pushing to expand the single currency’s global role, as US President Donald Trump roils markets and the US dollar weakens.",
      "content": "Euro-area finance chiefs are pushing to expand the single currency’s global role, as US President Donald Trump roils markets and the US dollar weakens.\n\nYou can save this article by registering for free here . Or sign-in if you have an account.\n\n(Bloomberg) — Euro-area finance chiefs are pushing to expand the single currency’s global role, as US President Donald Trump roils markets and the US dollar weakens.\n\nSubscribe now to read the latest news in your city and across Canada.\n\nSubscribe now to read the latest news in your city and across Canada.\n\nCreate an account or sign in to continue with your reading experience.\n\nCreate an account or sign in to continue with your reading experience.\n\n“In light of recent geopolitical events in our current geopolitical context, there are risks that the international financial and monetary system is being used as a political tool,” said Greek Finance Minister Kyriakos Pierrakakis, who chairs the meetings of his euro-area peers. “It is thus existential for us to safeguard the international role of the euro as it is quite pertinent for the EU’s monetary sovereignty.”\n\nThe comments come just after the European Central Bank introduced its strongest move yet to promote the euro. Over the weekend, the monetary-policy institution announced that it’s prepared to offer euro liquidity to central banks from around the world.\n\nGet the latest headlines, breaking news and columns.\n\nBy signing up you consent to receive the above newsletter from Postmedia Network Inc.\n\nA welcome email is on its way. If you don't see it, please check your junk folder.\n\nThe next issue of Top Stories will soon be in your inbox.\n\nWe encountered an issue signing you up. Please try again\n\nInterested in more newsletters? Browse here.\n\nThat proposal is one of the ideas included in a European Commission paper prepared ahead of the ministers’ meeting in Brussels on Monday.\n\nThe document — seen by Bloomberg — called for reinforcing euro diplomacy by reassuring partner countries about access to the common currency.\n\n“With the United States potentially less inclined to supply dollar liquidity during periods of stress, offering euro-denominated liquidity to partner countries could serve as a valuable complement to the EU trading strategy and boost the international role of the euro,” the document said.\n\nThe document explored ways to promote the use of the euro in issuance and transactions, especially in key sectors such as the energy, critical raw materials, air transport and defense sectors.\n\nThe ECB has repeatedly stressed the need to boost the euro’s international standing, and Bundesbank President Joachim Nagel on Monday reiterated that sentiment, calling on governments to “channel efforts.”\n\n“International investors want to diversify, they are looking for contact with Europe, that’s why we want to be a safe haven for the capital investments from the entire world,” said German Finance Minister Lars Klingbeil, who together with his French counterpart pushed for more rapid action.\n\n“Faced with massive challenges across the world, the EU has to be stronger, the EU has to be faster, the EU has to work on its competitiveness and its ability to be powerful and independent,” Roland Lescure said. “Europe is very good at moving well — we also need to make it better at moving faster and this is what we’re gonna do.”\n\nStill, French officials want a deeper understanding of how such a move may harm exporters by driving up the euro against the dollar, a finance ministry official said, briefing journalists on condition of anonymity.\n\nEU Economy Commissioner Valdis Dombrovskis, speaking after Monday’s meeting, said the bloc must carefully watch for these spill-over effects.\n\n“In a context of a stronger international role for the euro, we also must consider what implications it would mean for exchange rate,” he said.\n\nMinisters also addressed the rise of global imbalances during Monday’s gathering, bringing in the Canadian Finance Minister Francois-Philippe Champagne to discuss the matter. Dombrovskis said China and the US are driving the growing imbalances.\n\n“The current Chinese and US policies are the biggest contributors to the rise of imbalances, but the EU, however, also has work to do,” he said. “There is a scope for an increase in investments, especially when it comes to putting private investments to work.”\n\nHe urged leaders to come together on the issue, warning that inaction may hamper the global economy.\n\n“The world’s largest economies should not leave these balances unaddressed,” he said. “They pose real risks, such as furthering trade tensions but also macroeconomic and financial risks. So there is a shared interest to manage and reduce them together. “\n\n—With assistance from James Regan, Lyubov Pronina, Sofia Horta e Costa and Mark Schroers.\n\n(Updates with Nagel in eighth, Dombrovskis starting in 12th paragraph.)\n\nPostmedia is committed to maintaining a lively but civil forum for discussion. Please keep comments relevant and respectful. Comments may take up to an hour to appear on the site. You will receive an email if there is a reply to your comment, an update to a thread you follow or if a user you follow comments. Visit our Community Guidelines for more information.",
      "url": "https://financialpost.com/pmn/business-pmn/euro-area-finance-chiefs-push-for-bigger-role-of-single-currency",
      "urlToImage": null,
      "publishedAt": "2026-02-16T14:41:40+00:00",
      "content_truncated": "(Bloomberg) Euro-area finance chiefs are pushing to expand the single currencys global role, as US President Donald Trump roils markets and the US dollar weakens.\r\nTHIS CONTENT IS RESERVED FOR SUBSCR… [+4513 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "Digital Journal"
      },
      "author": "AFP",
      "title": "Asian markets sluggish as Lunar New Year holiday looms",
      "description": "The holiday period meant that trading floors were closed in mainland China, Seoul and Taipei.\nThe post Asian markets sluggish as Lunar New Year holiday looms appeared first on Digital Journal.",
      "content": "The holiday period meant that trading floors were closed in mainland China, Seoul and Taipei.\n\nAsian markets were subdued on Monday, as the extended Lunar New Year holiday approached and Japan reported lacklustre economic growth.\n\nThe holiday period meant that trading floors were closed in mainland China, Seoul and Taipei. Hong Kong and Singapore have half-day trading on Monday.\n\nUS stock markets will also remain closed for Presidents’ Day.\n\nLimp gross domestic growth (GDP) in Japan rattled the post-election high of Prime Minister Sanae Takaichi following her recent landslide win.\n\nThe world’s fourth-biggest economy expanded just 0.1 percent in the last three months of 2025.\n\nThe figures — which undershoot market forecasts of 0.4 percent — add pressure on Takaichi, who made boosting economic growth a key pledge ahead of her landslide victory in February 8’s snap elections.\n\nThe weak growth “implies that the large supplementary budget passed at the end of November provided no boost to public spending last quarter just yet,” Marcel Thieliant at Capital Economics said.\n\n“In fact, sluggish economic activity increases the chances that Takaichi will not only press ahead with suspending the sales tax on food but enact a supplementary budget during the first half of the fiscal year that starts in April already rather than wait until the end of this year,” he added.\n\nTokyo was down 0.03 percent in early trading, while Wellington, Singapore, Jakarta, Bangkok, Manila, Kuala Lumpur and Mumbai also posted minimal losses. Hong Kong was up 0.4 percent.\n\nMarkets had stabilised, though, after a tech-led plunge last week, when traders reacted to growing concern about the hundreds of billions spent on AI infrastructure and when, if ever, they might see a return on them.\n\nInvestors will keep an eye on artificial intelligence this week as the five-day AI Impact Summit kicks off in New Delhi on Monday, with the likes of OpenAI CEO Sam Altman and Google’s Sundar Pichai in attendance.\n\nWhile frenzied demand for generative AI has turbocharged profits and share prices for many technology companies, anxiety is growing over the risks that it poses to society and the environment.\n\nThe sense of calm continued on from Friday, when government data showed consumer inflation in the United States cooling slightly more than expected in January.\n\nAnalysts say the figure allows the US central bank to cut interest rates again later this year, but warn that policymakers need to see sustained improvement in order to do so.\n\n“US inflation data was good. And the initial response in equities reflected that. But the devil was in the details,” said Kyle Rodda, senior financial market analyst at Capital.com.\n\n“Annual headline and core inflation dropped to new lows, with the critical core number falling to the lowest level since March 2021 at 2.4%.”\n\nGold crept past $5,000 an ounce, a decrease of 0.8 percent after it climbed following softer US inflation on Friday. Silver fell 1.8 percent.\n\n“Markets have priced in a higher probability of deeper Fed rate cuts this year, driving real yields lower and supporting gold demand,” Standard Chartered said in a note.\n\n“We expect gold to remain well supported.”\n\nTokyo – Nikkei 225: DOWN 0.03 percent at 56,923.44\n\nHong Kong – Hang Seng Index: UP 0.4 percent at 26,662.38\n\nShanghai – Composite: market closed for holiday\n\nDollar/yen: DOWN 0.3 percent at 153.08 yen from 152.71 yen on Friday\n\nEuro/dollar: DOWN 0.01 percent at $1.1867 from $1.1876\n\nPound/dollar: DOWN 0.07 percent at $1.3641 from $1.3654\n\nEuro/pound: DOWN 0.06 percent at 86.99 pence from 86.96 pence\n\nWest Texas Intermediate: DOWN 0.05 percent at $62.86 per barrel\n\nBrent North Sea Crude: DOWN 0.09 percent at $67.69 per barrel\n\nNew York – Dow: UP 0.1 percent at 49,500.93 (close)\n\nLondon – FTSE 100: UP 0.4 percent at 10,446.35 (close)\n\nWith 2,400 staff representing 100 different nationalities, AFP covers the world as a leading global news agency. AFP provides fast, comprehensive and verified coverage of the issues affecting our daily lives.\n\nTech CEOs are locked in an artificial intelligence \"arms race\" that risks wiping out humanity, said computer science researcher Stuart Russell.\n\nFrom Donald Trump to Vladimir Putin, no one is safe when Germans celebrate carnival with floats that satirise politicians.\n\nShares dipped and oil prices dropped back Tuesday as Tehran gave an encouraging response during talks with US officials in Geneva.\n\nHow PCL is using AI to standardize complex project data across large industrial construction builds",
      "url": "https://www.digitaljournal.com/world/asian-markets-sluggish-as-lunar-new-year-holiday-looms/article",
      "urlToImage": "https://www.digitaljournal.com/wp-content/uploads/2026/02/8cf02cc0181cfd8e38656d142b81f09b91bf8604.jpg",
      "publishedAt": "2026-02-16T14:35:24+00:00",
      "content_truncated": "The Lunar New Year holiday has closed trading floors in mainland China, Seoul and Taipei - Copyright AFP ADEK BERRY \r\nAsian markets were subdued on Monday, as the extended Lunar New Year holiday appr… [+3712 chars]",
      "content_extracted_from_url": true
    },
    {
      "source": {
        "id": null,
        "name": "Theflightdeal.com"
      },
      "author": "The Flight Deal",
      "title": "United: Boston – Porto, Portugal. $376 (Basic Economy) / $576 (Regular Economy). Roundtrip, including all Taxes",
      "description": "A good sale to Porto. Pricing will vary slightly depending on routing.United and its partners Air Canada, Austrian, Lufthansa and Swiss Air's $576 fare is a regular economy fare with ONE check lug",
      "content": "A good sale to Porto. Pricing will vary slightly depending on routing.\n\nUnited and its partners Air Canada, Austrian, Lufthansa and Swiss Air’s $576 fare is a regular economy fare with ONE check luggage and normal size carry-on included\n\nUnited and its partners Air Canada, Austrian, Lufthansa and Swiss Air also have a $376 fare, but it is a Basic Economy / Economy Light fare. These Basic Economy / Economy Light fares:\n\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted on our website and social media channels - all for about a nickel a day.\n\nSign up for our Real Time Newsletter to receive economy class deals for your city about an hour before they are even posted on our website and social media channels - all for about a nickel a day.\n\nInterested in Business Class, First Class or Premium Economy deals? Signup for our Premium Newsletter for about a quarter a day.\n\nInterested in Business Class, First Class or Premium Economy deals? Signup for our Premium Newsletter for about a quarter a day.\n\nPorto, Portugal – Photo: Chris Owen via Flickr , used under Creative Commons License (By 2.0)\n\nFor more of the latest cheap Boston Flight Deals:\n\n* The Flight Deal will receive a commission if you use the Priceline, accommodation, car rental, activities, or travel insurance affiliate links to make a booking or apply and is approved for a credit card using our link above. Thank you for your continuing support.\n\nTo make sure you receive our latest deals, LIKE our The Flight Deal Facebook Page , follow us on Twitter @TheFlightDeal , Threads @TheFlightDeal or The Flight Deal WhatsApp channel or subscribe to The Flight Deal RSS Feed or Subscribe via Email (Once a Day)\n\nThe Flight Deal does not sell travel products or services. We provide  you with information about third-party travel suppliers’ offers, and  link you to their sites. The information posted by The Flight Deal is  valid at the time of publication. However, we have no control over the  suppliers, and we therefore do not warrant or guarantee that their  offers will not change or become unavailable. Nor are we responsible for  their products, services or site content. Please see their sites for  their most up-to-date offer information and all applicable terms and  conditions.\n\nSign up to receive The Flight Deal Daily DealsLetter, to stay up to date with the latest and greatest flight deals available.\n\nSave my name, email, and website in this browser for the next time I comment.",
      "url": "https://www.theflightdeal.com/2026/02/16/united-boston-porto-portugal-376-basic-economy-576-regular-economy-roundtrip-including-all-taxes/",
      "urlToImage": "https://www.theflightdeal.com/wp-content/uploads/2015/12/porto_portugal-640x390.jpg",
      "publishedAt": "2026-02-16T14:23:57+00:00",
      "content_truncated": "A good sale to Porto. Pricing will vary slightly depending on routing.\r\nUnited and its partners Air Canada, Austrian, Lufthansa and Swiss Airs $576 fare is a regular economy fare with ONE check lugga… [+5213 chars]",
      "content_extracted_from_url": true
    }
  ]
}